{
    "name": {
        "speaker_1": "Emi",
        "speaker_2": "Paola"
    },
    "session_1": [
        {
            "clean_text": "Hey! How are you? Anything exciting happen lately?",
            "speaker": "Emi",
            "date_time": "06.01.2024, 19:13:14",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:1"
        },
        {
            "clean_text": "Hello! I'm good thank you for asking. How are you? I have been watching tv series all day. I have been obsessed with the Netflix show called \"The Profector\". What about you? Anything fun lately?",
            "speaker": "Paola",
            "date_time": "06.01.2024, 19:32:58",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:2"
        },
        {
            "clean_text": "I'm doing well, thanks! Oh, \"The Profector\" sounds interesting. I haven't heard about it before. What's it about, and what do you like most about the show? Lately, I have also been catcing up on some tv shows, I'm currently finishing \"Gossip Girl\", have you watched it? If not, I highly recommend it",
            "speaker": "Emi",
            "date_time": "06.01.2024, 19:36:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:3"
        },
        {
            "clean_text": "My cat, Fluffy, is keeping me company. Haha!",
            "speaker": "Emi",
            "date_time": "06.01.2024, 19:38:48",
            "img_file": [
                "00000123-PHOTO-2024-01-06-19-38-36.jpg",
                "00000123-PHOTO-2024-01-06-19-38-36_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D1:5",
            "blip_caption": "there is a cat sitting on a table in front of a tv"
        },
        {
            "clean_text": "It is very interesting I recommend it to you if you like fantasy. It's all unreal the main character, which is Cagatay Ulusoy transforms from a normal person to the protector of the world. I started watching it because he is my favorite male actor, but I am really enjoying it. It teaches a lot of things even though it is fantasy genre. What does \"Gossip Girl\" talk about? I have heard about it, but never watched any episodes of it.",
            "speaker": "Paola",
            "date_time": "06.01.2024, 19:41:42",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:6"
        },
        {
            "clean_text": "She looks adorable! I like cats, but I'm mostly into dogs. Let me show you my dog his name is Brad.",
            "speaker": "Paola",
            "date_time": "06.01.2024, 19:43:02",
            "img_file": [
                "00000127-PHOTO-2024-01-06-19-43-50.jpg",
                "00000127-PHOTO-2024-01-06-19-43-50_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D1:7",
            "blip_caption": "there is a dog that is sitting on the ground looking up"
        },
        {
            "clean_text": "\"Gossip Girl\" revolves around the lives of wealthy teenagers living in New York City. The series follows their romantic entanglements, social dramas, and the mysterious blogger known as Gossip Girl, who exposes their secrets. It's a mix of drama, romance, and intrigue within the elite social circles of Manhattan. If you enjoy character-driven stories with a touch of mystery, it might be worth checking out!",
            "speaker": "Emi",
            "date_time": "06.01.2024, 19:46:27",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:9"
        },
        {
            "clean_text": "He looks adorable! I am allergic to dog’s thats why I adopted a cat!",
            "speaker": "Emi",
            "date_time": "06.01.2024, 19:46:50",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:10"
        },
        {
            "clean_text": "Apart from watching tv shows, what else do you like to do in your free time?",
            "speaker": "Emi",
            "date_time": "06.01.2024, 19:47:09",
            "img_file": [
                "00000132-PHOTO-2024-01-06-19-47-59.jpg",
                "00000132-PHOTO-2024-01-06-19-47-59_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D1:11",
            "blip_caption": "two white rabbits sitting in the grass with their ears up"
        },
        {
            "clean_text": "I used to have these rabbits. I grew up with them when I lived in Houston, but now I transferred to New York and I couldn't take them with me.",
            "speaker": "Paola",
            "date_time": "06.01.2024, 19:49:07",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:13"
        },
        {
            "clean_text": "I like hanging out with my friends. Most of them live far away from me and I miss them a lot. We always meet for holidays though and always catch up with each other through video calls. I also love traveling and meeting my friends or family members all around the world.",
            "speaker": "Paola",
            "date_time": "06.01.2024, 19:51:16",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:14"
        },
        {
            "clean_text": "What about you? What is your name? Sorry I forgot to ask you",
            "speaker": "Paola",
            "date_time": "06.01.2024, 19:51:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:15"
        },
        {
            "clean_text": "It must have been tough leaving your rabbits behind during the move to New York. How are you coping with the change?",
            "speaker": "Emi",
            "date_time": "06.01.2024, 20:10:49",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:16"
        },
        {
            "clean_text": "It sounds like you have a strong connection with your friends, despite the distance. Video calls and holiday gatherings must be a great way to stay close. What's one memorable place you've traveled to meet friends or family?",
            "speaker": "Emi",
            "date_time": "06.01.2024, 20:11:26",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:17"
        },
        {
            "clean_text": "No worries, my name is Bella, and yours?",
            "speaker": "Emi",
            "date_time": "06.01.2024, 20:11:42",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:18"
        },
        {
            "clean_text": "It was hard in the beginning, but now I got used to it. I have been living in New York since September, so now it is easier for me.",
            "speaker": "Paola",
            "date_time": "06.01.2024, 20:25:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:19"
        },
        {
            "clean_text": "I went to Italy to meet one of my best friends. My other two friends are here in America, but one of them left for studies this semester in Australia. It was a tough decision, but I am really proud of him. Out Italy experience was the best with the four of us being there together. Also the weather was great during summer that we were there.",
            "speaker": "Paola",
            "date_time": "06.01.2024, 20:25:25",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:20"
        },
        {
            "clean_text": "My name is Liza. It's nice meeting you Bella!",
            "speaker": "Paola",
            "date_time": "06.01.2024, 20:25:55",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:21"
        },
        {
            "clean_text": "It's great to hear that you've adapted to living in New York. Moving can be quite an adjustment, but it sounds like you've settled in well.",
            "speaker": "Emi",
            "date_time": "06.01.2024, 20:28:01",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:22"
        },
        {
            "clean_text": "And it's a pleasure to meet you, Liza! Your experiences with pets, travels, and connections with friends are so interesting. Is there anything specific you're looking forward to in the coming weeks or any plans you're excited about?",
            "speaker": "Emi",
            "date_time": "06.01.2024, 20:28:10",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:23"
        },
        {
            "clean_text": "Italy was a dream come true! I loved every moment, but my favorite part was exploring the ancient ruins in Rome.",
            "speaker": "Paola",
            "date_time": "06.01.2024, 20:30:10",
            "img_file": [
                "00000146-PHOTO-2024-01-06-20-30-15.jpg",
                "00000146-PHOTO-2024-01-06-20-30-15_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D1:24",
            "blip_caption": "arafed view of a large building with a lot of people walking around"
        },
        {
            "clean_text": "The Colosseum and Roman Forum were breathtaking. Have you been to Italy or any other destination that left a lasting impression on you?",
            "speaker": "Paola",
            "date_time": "06.01.2024, 20:30:40",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:26"
        },
        {
            "clean_text": "In the coming weeks, I'm planning a small get-together with some friends here in New York. It's always nice to catch up and share some good moments. What about you, Bella? Any exciting plans or events on your horizon?",
            "speaker": "Paola",
            "date_time": "06.01.2024, 20:30:59",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:27"
        },
        {
            "clean_text": "I haven't been to Italy yet, but it's on my travel bucket list! The ancient ruins sound fascinating, and I can imagine the historical atmosphere",
            "speaker": "Emi",
            "date_time": "06.01.2024, 20:31:11",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:28"
        },
        {
            "clean_text": "As for me, I'm looking forward to a weekend hiking trip. There's a beautiful trail I've been wanting to explore, surrounded by nature and scenic views, in Los Angeles. It's a great way for me to unwind and enjoy some time outdoors.",
            "speaker": "Emi",
            "date_time": "06.01.2024, 20:32:11",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:29"
        },
        {
            "clean_text": "Here it is!",
            "speaker": "Emi",
            "date_time": "06.01.2024, 20:32:50",
            "img_file": [
                "00000152-PHOTO-2024-01-06-20-32-44.jpg",
                "00000152-PHOTO-2024-01-06-20-32-44_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D1:31",
            "blip_caption": "there are many people hiking up a mountain trail in the mountains"
        },
        {
            "clean_text": "Let me know how it goes with your friends Liza! Speak soon",
            "speaker": "Emi",
            "date_time": "06.01.2024, 20:33:22",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:32"
        },
        {
            "clean_text": "Will do!",
            "speaker": "Paola",
            "date_time": "06.01.2024, 20:34:20",
            "img_file": [],
            "img_url": [],
            "dia_id": "D1:33"
        }
    ],
    "events_session_1": {
        "agent_a": [
            {
                "sub-event": "Emi is finishing watching the tv show \"Gossip Girl\".",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi plans a weekend hiking trip in Los Angeles.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola watches a Netflix show \"The Profector\" all day.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola plans a small get-together with friends in New York in the coming weeks.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_2": [
        {
            "clean_text": "Hello Bella! How are you feeling today? Did you do anything fun?",
            "speaker": "Paola",
            "date_time": "07.01.2024, 18:59:54",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:1"
        },
        {
            "clean_text": "Hey Liza! Today was fantastic! I decided to spontaneously try a new recipe, and it turned out delicious. It was this exotic dish I've never attempted before, and the flavors were amazing. I even invited a friend over, and we had a mini cooking party. It was so much fun! How about you? Anything thrilling on your end?",
            "speaker": "Emi",
            "date_time": "07.01.2024, 20:00:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:2"
        },
        {
            "clean_text": "That sounds like such a delightful day! Cooking parties are always a blast. I spent the morning exploring a local art gallery. There's something about the way artists express themselves that truly captivates me. Plus, it's a great way to support local talent. Do you have any favorite chef or types of cuisine you enjoy experimenting with?",
            "speaker": "Paola",
            "date_time": "07.01.2024, 20:05:30",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:3"
        },
        {
            "clean_text": "Exploring an art gallery sounds like a wonderful way to spend the morning. I appreciate various cuisines, but I do have a soft spot for Mediterranean flavors. The combination of olive oil, fresh herbs, and bold spices always creates a delightful taste. Lately, I've been experimenting with recipes inspired by Greek and Moroccan cuisines. Do you have any favorite artists or specific types of art that you enjoy at galleries?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 01:55:21",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:4"
        },
        {
            "clean_text": "That's fantastic! Mediterranean cuisine has such a rich and diverse palette of flavors. Greek and Moroccan dishes must bring a lot of warmth and vibrancy to your meals. As for art, I'm drawn to impressionist paintings. The way artists capture the essence of a moment with brushstrokes and color choices is truly mesmerizing. Claude Monet is one of my favorites; his water lily series has a timeless beauty. Do you have a particular dish or recipe from your recent cooking adventures that stood out as a favorite?",
            "speaker": "Paola",
            "date_time": "08.01.2024, 01:56:07",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:5"
        },
        {
            "clean_text": "From my recent cooking adventures, I tried making a Moroccan-inspired tagine with a blend of spices, apricots, and tender lamb. The combination of sweet and savory flavors was a hit! It's always rewarding when an experiment turns into a favorite. How about you, any standout dish from your cooking or perhaps a favorite from a local restaurant you've discovered in New York?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 02:00:29",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:7"
        },
        {
            "clean_text": "That looks fantastic! I recently tried a dish called Chicken and Waffles from a local brunch spot here in New York. It's an interesting combination of crispy fried chicken served on top of fluffy waffles, drizzled with maple syrup. The contrast of sweet and savory was surprisingly delightful. Do you have any favorite local spots or hidden gems in Los Angeles that you'd recommend?",
            "speaker": "Paola",
            "date_time": "08.01.2024, 02:04:16",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:8"
        },
        {
            "clean_text": "Chicken and Waffles is a classic comfort food combination, and it sounds like you found a delicious version of it! In Los Angeles, there's this charming little café called \"Café Serenity.\" They specialize in a variety of artisanal coffees and pastries, and the cozy ambiance makes it a perfect spot to unwind. The almond croissants there are a personal favorite. Have you discovered any hidden gems or favorite places in New York since you moved there?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 02:08:05",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:9"
        },
        {
            "clean_text": "In New York, I stumbled upon a small bookstore in the West Village called \"Prose & Pages.\" It has a charming collection of both new and vintage books, and the cozy reading nooks invite you to spend hours lost in a good story. It has become my go-to place when I need a break from the bustling city. Do you have a favorite genre or type of book you enjoy reading during your downtime?",
            "speaker": "Paola",
            "date_time": "08.01.2024, 02:11:06",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:10"
        },
        {
            "clean_text": "\"Prose & Pages\" sounds like a book lover's paradise! I appreciate a wide range of genres, but I find myself gravitating towards science fiction and fantasy. The ability of authors to create intricate worlds and explore imaginative concepts is fascinating to me. Recently, I've been engrossed in a series about intergalactic exploration. How about you? Any favorite books or genres that you often find yourself immersed in?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 02:14:13",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:12"
        },
        {
            "clean_text": "Science fiction and fantasy are such captivating genres, allowing the mind to wander into otherworldly realms. One of my all-time favorite books is \"The Night Circus\" by Erin Morgenstern. The way she weaves magic and enchantment into the story is truly mesmerizing. I also enjoy historical fiction; the blend of real events with fictional narratives adds a unique layer to the storytelling. Have you read any books recently that left a lasting impression on you?",
            "speaker": "Paola",
            "date_time": "08.01.2024, 02:16:24",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:13"
        },
        {
            "clean_text": "\"The Night Circus\" is a magical and enchanting novel, and I completely understand why it's one of your favorites. Lately, I read \"The Invisible Life of Addie LaRue\" by V.E. Schwab. The exploration of immortality and the impact of choices on one's life was thought-provoking. It's always refreshing to discover books that linger in your thoughts long after you've finished them. Any other novels or literary works that have left a lasting impression on you?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 02:18:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:14"
        },
        {
            "clean_text": "I was also thinking of joining a book club, what do you think about them?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 02:19:27",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:15"
        },
        {
            "clean_text": "Joining a book club has always been a desire of mine, driven by the eagerness to delve deeper into the world of literature. The prospect of engaging in thoughtful discussions, gaining diverse perspectives, and exploring a variety of genres excites me. Being part of a book club seems like an enriching journey, an avenue to discover new authors, share insights, and expand my reading horizons.",
            "speaker": "Paola",
            "date_time": "08.01.2024, 02:20:41",
            "img_file": [],
            "img_url": [],
            "dia_id": "D2:16"
        }
    ],
    "events_session_2": {
        "agent_a": [
            {
                "sub-event": "Emi tries a new recipe and has a mini cooking party with a friend.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi plans to join a book club.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola spends the morning exploring a local art gallery.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_3": [
        {
            "clean_text": "Hey Liza! How are you today?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 22:23:07",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:1"
        },
        {
            "clean_text": "I am pretty good Bella, what about you, did you do any fun activities today?",
            "speaker": "Paola",
            "date_time": "08.01.2024, 22:24:25",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:2"
        },
        {
            "clean_text": "I went to the cinema to catch the latest Hunger Games movie. It was a much needed break from the daily routine, and I thoroughly enjoyed the experience. The movie had amazing special effects, a gripping storyline, and the performances of the actors were quite good. I couldn't help but get lost in the world of the film for a couple of hours.",
            "speaker": "Emi",
            "date_time": "08.01.2024, 22:26:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:3"
        },
        {
            "clean_text": "How about you anything interesting happen?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 22:26:40",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:4"
        },
        {
            "clean_text": "Oh, that sounds like a fantastic way to take a break from the daily routine. I'm so glad you enjoyed watching the latest Hunger Games movie. Movies have a way of transporting us to different worlds, don't they? As for me, I haven't been to the cinema recently, but I love watching movies too. Do you have any other favorite movies or genres you enjoy?",
            "speaker": "Paola",
            "date_time": "08.01.2024, 22:32:19",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:5"
        },
        {
            "clean_text": "Besides the Hunger Games series, I'm a fan of science fiction and fantasy movies. I love the sense of wonder and adventure they often bring. Some of my other favorites include the Lord of the Rings trilogy, the Star Wars saga, and the Marvel Cinematic Universe movies. Do you have any favorite movies or genres that you're particularly fond of?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 22:34:09",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:6"
        },
        {
            "clean_text": "The theater was quite empty today",
            "speaker": "Emi",
            "date_time": "08.01.2024, 22:35:18",
            "img_file": [
                "00000180-PHOTO-2024-01-08-22-35-10_opt.jpg",
                "00000180-PHOTO-2024-01-08-22-35-10.jpg"
            ],
            "img_url": [],
            "dia_id": "D3:8",
            "blip_caption": "there are many black seats lined up in a row"
        },
        {
            "clean_text": "Remember I told you about the movie I was watching \"The Protector\". That would be a really good one for you that you like fantasy in movies. My favorite genre is romance. \"The Notebook\" it's an all time favorite for me. Oh I think it depends on the theater you were watching. What was it about?",
            "speaker": "Paola",
            "date_time": "08.01.2024, 22:40:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:9"
        },
        {
            "clean_text": "I watched \"The Protector,\" and it was an absolute thrill! The visual effects were stunning, bringing the fantastical elements to life in a way that left me in awe. The world-building was meticulous, and I found myself immersed in every scene.",
            "speaker": "Emi",
            "date_time": "08.01.2024, 22:43:13",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:10"
        },
        {
            "clean_text": "\"The Notebook\" is also one of my favorites, truly a classic.",
            "speaker": "Emi",
            "date_time": "08.01.2024, 22:43:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:11"
        },
        {
            "clean_text": "Do you enjoy comedy movies? If so what are your favorites? I need to bring up my mood today, and a comedy movie would just do the job",
            "speaker": "Emi",
            "date_time": "08.01.2024, 22:45:12",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:12"
        },
        {
            "clean_text": "Comedy movies are a great way to lift your spirits and bring some laughter into your day. As for my favorites, I really enjoyed \"Superbad,\" and \"Bridesmaids.\" They always manage to make me laugh no matter how many times I've watched them. If you're looking for a recommendation, \"Step Brothers\" is a hilarious comedy.",
            "speaker": "Paola",
            "date_time": "08.01.2024, 22:47:26",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:13"
        },
        {
            "clean_text": "Thank you for the recommendations! I've heard great things about \"Step Brothers,\" so I'll definitely give it a try. Laughter is the best medicine, and I could use some humor today.",
            "speaker": "Emi",
            "date_time": "08.01.2024, 22:48:46",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:14"
        },
        {
            "clean_text": "What is your favorite snack when watching movies?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 22:48:55",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:15"
        },
        {
            "clean_text": "I love mixing up sour things with sweet ones. Like popcorn and maybe candy or coca cola after, but when I watch movies at home I love cooking small things. Yesterday while watching a romance again I made some very delicious tacos.",
            "speaker": "Paola",
            "date_time": "08.01.2024, 22:58:41",
            "img_file": [
                "00000190-PHOTO-2024-01-08-22-58-46.jpg",
                "00000190-PHOTO-2024-01-08-22-58-46_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D3:16",
            "blip_caption": "there are two tacos sitting on a plate on a table"
        },
        {
            "clean_text": "They were even better than the picture in taste",
            "speaker": "Paola",
            "date_time": "08.01.2024, 22:59:08",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:18"
        },
        {
            "clean_text": "Those tacos look absolutely mouthwatering! Mixing sour and sweet snacks like popcorn and candy is a great choice when watching movies. It's the perfect combination to satisfy both salty and sweet cravings. Tacos sound like a fantastic choice for a cozy movie night at home. Do you have any favorite toppings or fillings you like to put in your tacos?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 23:32:39",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:19"
        },
        {
            "clean_text": "Certainly! Tacos are so versatile, and there are endless options for toppings and fillings. Some of my favorite taco toppings include fresh salsa, guacamole, shredded cheese, sour cream, and a squeeze of lime for that extra zing. Speaking of food, have you tried any interesting or unique dishes lately, either at home or at a restaurant? Exploring different cuisines can be a delightful culinary adventure.",
            "speaker": "Paola",
            "date_time": "08.01.2024, 23:36:35",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:20"
        },
        {
            "clean_text": "Greek cuisine is known for its delicious and flavorful dishes! One of the classics is moussaka, a hearty casserole made with layers of eggplant, ground meat (usually beef or lamb), tomatoes, and béchamel sauce. It's a comforting and satisfying dish with a rich taste.\nAnother popular Greek dish is souvlaki, which consists of skewered and grilled pieces of marinated meat (often pork, chicken, or lamb) served with pita bread and various toppings like tomatoes, onions, and tzatziki sauce. It's a great choice for a quick and tasty meal.\nIf you're a fan of seafood, you might enjoy trying Greek-style grilled octopus or a traditional Greek salad with feta cheese, olives, cucumbers, and tomatoes drizzled with olive oil and oregano. These dishes showcase the fresh and vibrant flavors of Mediterranean cuisine.\nHave you had the chance to explore Greek cuisine or try any of these dishes?",
            "speaker": "Emi",
            "date_time": "08.01.2024, 23:38:30",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:21"
        },
        {
            "clean_text": "This is what I made a few nights ago.",
            "speaker": "Emi",
            "date_time": "08.01.2024, 23:39:20",
            "img_file": [
                "00000196-PHOTO-2024-01-08-23-39-07_opt.jpg",
                "00000196-PHOTO-2024-01-08-23-39-07.jpg"
            ],
            "img_url": [],
            "dia_id": "D3:23",
            "blip_caption": "arafed table with plates of food and glasses of wine"
        },
        {
            "clean_text": "I'm glad to hear you've had the chance to enjoy Greek cuisine! Greek food offers a wonderful combination of fresh ingredients, bold flavors, and Mediterranean influences. If you ever decide to experiment with Greek cooking at home, you might want to try making dishes like spanakopita (spinach and feta cheese pie), Greek lemon chicken, or baklava (a sweet pastry made with layers of phyllo dough, nuts, and honey). Cooking these dishes can be a fun culinary adventure and a way to savor the flavors of Greece in the comfort of your own kitchen. My mom always makes \"spanakopita\" for me when I am tired. It's a favorire dish of mine. Look how good her cooking looks.",
            "speaker": "Paola",
            "date_time": "08.01.2024, 23:44:52",
            "img_file": [
                "00000199-PHOTO-2024-01-08-23-44-57.jpg",
                "00000199-PHOTO-2024-01-08-23-44-57_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D3:24",
            "blip_caption": "there is a plate with a sandwich and spinach leaves on it"
        },
        {
            "clean_text": "That looks very good, I will definitely try to make it one day",
            "speaker": "Emi",
            "date_time": "08.01.2024, 23:47:17",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:26"
        },
        {
            "clean_text": "It was lovely chatting with you today Liza! Let's catch up tomorrow!",
            "speaker": "Emi",
            "date_time": "08.01.2024, 23:48:19",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:27"
        },
        {
            "clean_text": "Sure we will do!",
            "speaker": "Paola",
            "date_time": "09.01.2024, 00:09:06",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:28"
        }
    ],
    "events_session_3": {
        "agent_a": [
            {
                "sub-event": "Emi went to the cinema for the \"Hunger Games\" movie.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola made tacos yesterday.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_4": [
        {
            "clean_text": "Hey Liza how have you been today? I was wondering if you joined the book club you were telling me about a few days ago.",
            "speaker": "Emi",
            "date_time": "10.01.2024, 02:02:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:29"
        },
        {
            "clean_text": "Hey Bella! I’ve been good, thanks for asking. Yes, I did join that book club! It’s been an amazing experience so far. The people are great, and the book selections are fantastic. How’s everything with you in LA?",
            "speaker": "Paola",
            "date_time": "10.01.2024, 02:21:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:30"
        },
        {
            "clean_text": "That’s awesome to hear! I’m doing well, just busy with work as usual. The weather here has been perfect though. Have you started reading any interesting books in the club?",
            "speaker": "Emi",
            "date_time": "10.01.2024, 02:22:47",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:31"
        },
        {
            "clean_text": "I'm glad to hear that you're doing well. A friend recommended a book to me today. It is titled \"The Alchemist\". As she told me about it, it is a captivating novel that explores the themes of following your dreams and finding your true purpose in life. It's a thought-provoking and inspiring read that many people have found to be quite impactful.",
            "speaker": "Paola",
            "date_time": "10.01.2024, 02:28:28",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:32"
        },
        {
            "clean_text": "\"The Alchemist\" by Paulo Coelho? I've read it and absolutely loved it! Your friend is right, it's incredibly inspiring. The story's message about following your dreams and listening to your heart really resonated with me.",
            "speaker": "Emi",
            "date_time": "10.01.2024, 02:31:19",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:33"
        },
        {
            "clean_text": "Have you started reading it yet?",
            "speaker": "Emi",
            "date_time": "10.01.2024, 02:31:40",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:34"
        },
        {
            "clean_text": "Not yet, but I'm planning to pick it up this weekend. I've heard so much about it and your enthusiasm just makes me more excited to dive in. It's always fascinating to find books that challenge you to think about your life's path.",
            "speaker": "Paola",
            "date_time": "10.01.2024, 02:32:17",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:35"
        },
        {
            "clean_text": "Definitely! When you start it, let me know what you think. It’s one of those books that's great to discuss with friends. It might even be a good pick for your future book club!",
            "speaker": "Emi",
            "date_time": "10.01.2024, 02:36:06",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:36"
        },
        {
            "clean_text": "Absolutely, I'll keep that in mind. It sounds like the perfect book for a group discussion. How often does your book club meet, by the way?",
            "speaker": "Paola",
            "date_time": "10.01.2024, 02:38:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:37"
        },
        {
            "clean_text": "We meet once a month. It gives everyone enough time to read the book without feeling rushed. Plus, it's a great way to stay connected and share different perspectives on the same story. For instance, this first month of mine, we're reading \"Becoming\" by Michelle Obama. It's sparked some really insightful conversations already.",
            "speaker": "Emi",
            "date_time": "10.01.2024, 02:42:08",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:38"
        },
        {
            "clean_text": "I think it was a great book to begin my book club journey.",
            "speaker": "Emi",
            "date_time": "10.01.2024, 02:42:32",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:39"
        },
        {
            "clean_text": "Once a month sounds doable. Maybe I'll look for a club with a similar schedule. Thanks for the insight, Bella. You always have the best book recommendations!",
            "speaker": "Paola",
            "date_time": "10.01.2024, 02:53:17",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:40"
        },
        {
            "clean_text": "By the way I got my nails done. I stayed at my nails appointment 2 hours, it was very tiring. Do you like them?",
            "speaker": "Paola",
            "date_time": "10.01.2024, 02:55:01",
            "img_file": [
                "00000218-PHOTO-2024-01-10-02-54-21_opt.jpg",
                "00000218-PHOTO-2024-01-10-02-54-21.jpg"
            ],
            "img_url": [],
            "dia_id": "D3:42",
            "blip_caption": "someone is holding a hand with a green and white manicure"
        },
        {
            "clean_text": "I absolutely love the color combination. I always want to get my nails done but its such a long wait to have them finished. However, the result is always satisfying. Usually I tend to do them during the holidays or for a special occasion. How about you, do you do your nails often?",
            "speaker": "Emi",
            "date_time": "10.01.2024, 02:56:14",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:43"
        },
        {
            "clean_text": "I get what you mean about the wait time, but you're right, it's so worth it when you see the final look! I don't do my nails very often, usually just for special events. It's kind of a treat for me. What colors or designs are you thinking of trying next time?",
            "speaker": "Paola",
            "date_time": "10.01.2024, 02:58:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:44"
        },
        {
            "clean_text": "I was thinking of getting them done a bit sparkly next time, maybe with some glitter accents. I saw this gorgeous design with a midnight blue base and tiny gold stars. It feels perfect for a night out or a special dinner. Have you ever tried anything like that?",
            "speaker": "Emi",
            "date_time": "10.01.2024, 02:59:36",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:45"
        },
        {
            "clean_text": "Oh, that sounds absolutely stunning! I love the idea of a midnight blue with gold stars. I haven't tried that particular design, but I did have a similar one with a deep purple base and silver glitter. It was really eye-catching. Do you usually go for bold designs, or do you prefer something more subtle?",
            "speaker": "Paola",
            "date_time": "10.01.2024, 03:00:30",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:46"
        },
        {
            "clean_text": "I usually lean towards bolder designs, especially for special occasions. It's fun to experiment with different colors and patterns. For everyday wear, though, I tend to stick with more neutral tones – they're just easier to match with everything. How about you? Do you stick to certain colors, or do you like to mix it up?",
            "speaker": "Emi",
            "date_time": "10.01.2024, 03:01:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:47"
        },
        {
            "clean_text": "I'm pretty similar. For daily wear, I usually choose softer, more neutral shades like pastels or light pinks. They're so versatile and low maintenance. But for events or holidays, I love trying out brighter or unusual colors, maybe with some nail art or embellishments. It's a great way to add an extra pop to an outfit. Do you have a favorite nail salon, or do you do them yourself?",
            "speaker": "Paola",
            "date_time": "10.01.2024, 03:03:33",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:48"
        },
        {
            "clean_text": "I have a favorite nail salon in Los Angeles called Base Coat. Its in the Downtown Arts District. Now that we had this conversation it inspired me and I will book an appointment to get them done tomorrow, haha! I’ll show you tomorrow what color I get.",
            "speaker": "Emi",
            "date_time": "10.01.2024, 03:06:29",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:49"
        },
        {
            "clean_text": "Will do! Chat soon Bella and take care!",
            "speaker": "Paola",
            "date_time": "10.01.2024, 03:07:44",
            "img_file": [],
            "img_url": [],
            "dia_id": "D3:50"
        }
    ],
    "events_session_4": {
        "agent_a": [
            {
                "sub-event": "Emi plans to book an appointment in the nail salon tomorrow.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola joined a book club.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola plans to pick up the book \"The Alchemist\" this weekend.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola got her nails done.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_5": [
        {
            "clean_text": "Hello, Bella! How did your nail appointment go yesterday? I'm excited to see the new color you chose!",
            "speaker": "Paola",
            "date_time": "10.01.2024, 22:48:15",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:1"
        },
        {
            "clean_text": "Hey Liza! My nail appointment went really well, thank you for asking. I decided to go with a bright red.",
            "speaker": "Emi",
            "date_time": "10.01.2024, 22:50:09",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:2"
        },
        {
            "clean_text": "How was your day yesterday? Did you have a chance to start reading \"The Alchemist\"?",
            "speaker": "Emi",
            "date_time": "10.01.2024, 22:51:09",
            "img_file": [
                "00000230-PHOTO-2024-01-10-22-51-02.jpg",
                "00000230-PHOTO-2024-01-10-22-51-02_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D4:4",
            "blip_caption": "someone is doing a manicure on their nails with a pair of scissors"
        },
        {
            "clean_text": "Wow, your nails look amazing! The color really suits you. As for \"The Alchemist\", I did start reading it yesterday, and I'm already captivated by the story. Paulo Coelho's writing style is so engaging. Have you read any books recently that you'd recommend?",
            "speaker": "Paola",
            "date_time": "10.01.2024, 22:55:36",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:5"
        },
        {
            "clean_text": "Recently I read \"Where the Crawdads Sing\" by Delia Owens, and it was a beautifully written novel. It combines mystery, romance, and a deep connection to nature. I highly recommend it if you enjoy books with vivid descriptions of the natural world and a compelling storyline. Is there a particular genre you're interested in for future reading?",
            "speaker": "Emi",
            "date_time": "10.01.2024, 22:57:37",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:6"
        },
        {
            "clean_text": "\"Where the Crawdads Sing\" sounds intriguing, Bella. I'll definitely add it to my reading list. I'm quite open to various genres, but I do enjoy a good mystery or historical fiction novel.",
            "speaker": "Paola",
            "date_time": "10.01.2024, 23:00:58",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:7"
        },
        {
            "clean_text": "I'm glad you're considering it Liza.",
            "speaker": "Emi",
            "date_time": "10.01.2024, 23:02:28",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:8"
        },
        {
            "clean_text": "To change topics a bit, where do enjoy walking your dog Brad, in New York? I have a cat and I don't really need to take it outside.",
            "speaker": "Emi",
            "date_time": "10.01.2024, 23:03:09",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:9"
        },
        {
            "clean_text": "Brad and I like to go for walks in Central Park in New York City. It's a big, pretty park in the middle of the city. There are nice paths, open areas, and a special place where dogs can play with each other. We go there to get some fresh air and exercise. Since you have a cat, I was wondering if there are any fun things you do with your cat at home? Cats usually don't go outside like dogs, so they need different activities to keep them happy indoors.",
            "speaker": "Paola",
            "date_time": "10.01.2024, 23:08:53",
            "img_file": [
                "00000237-PHOTO-2024-01-10-23-08-45.jpg",
                "00000237-PHOTO-2024-01-10-23-08-45_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D4:11",
            "blip_caption": "araffe dog with a leash on a leash on a sidewalk"
        },
        {
            "clean_text": "With my cat indoors I have a few things I like to have and do for her such as:\nInteractive toys\nLaser pointer\nFeather wands\nCat tree & scratcher\nHide & seek treats\nPlay together\nCat TV\nRegular grooming\nIt keeps my cat happy and engaged indoors!",
            "speaker": "Emi",
            "date_time": "10.01.2024, 23:12:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:12"
        },
        {
            "clean_text": "However, rolling around in my nice blanket, is her favorite hobby.",
            "speaker": "Emi",
            "date_time": "10.01.2024, 23:12:46",
            "img_file": [
                "00000240-PHOTO-2024-01-10-23-12-35_opt.jpg",
                "00000240-PHOTO-2024-01-10-23-12-35.jpg"
            ],
            "img_url": [],
            "dia_id": "D4:14",
            "blip_caption": "there is a cat that is hiding under a blanket on a bed"
        },
        {
            "clean_text": "Your cat must be living the good life indoors with all those activities. And rolling in a cozy blanket sounds adorable! Cats really know how to find comfort.",
            "speaker": "Paola",
            "date_time": "10.01.2024, 23:48:27",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:15"
        },
        {
            "clean_text": "Speaking of comfort, where does your cat like to lounge around the most? My dog has a favorite sunny spot by the window that he claims as his throne.",
            "speaker": "Paola",
            "date_time": "10.01.2024, 23:48:41",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:16"
        },
        {
            "clean_text": "My cat's go-to spot is this fluffy, oversized cushion I have by the bookshelf. It's like her little kingdom, and she can watch me while I'm working or read a book. Cats truly have a talent for finding the comfiest spots in the house, don't they?",
            "speaker": "Emi",
            "date_time": "10.01.2024, 23:53:46",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:17"
        },
        {
            "clean_text": "Oh, absolutely! Cats are experts at finding the coziest spots in the house. It's like they have a built-in radar for comfort. Your fluffy, oversized cushion sounds like the purrfect kingdom for your cat. It's adorable how they like to keep an eye on us while we go about our day. I bet your cat feels like the ruler of that little corner by the bookshelf. Maybe you could take some pictures of her and send them to me someday",
            "speaker": "Paola",
            "date_time": "11.01.2024, 00:01:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:18"
        },
        {
            "clean_text": "What about your day today did you do anything new? Was it tiring?",
            "speaker": "Paola",
            "date_time": "11.01.2024, 00:02:17",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:19"
        },
        {
            "clean_text": "Haha, you're absolutely right! She does seem to rule her cushion kingdom with grace and elegance.  I'll definitely snap some pictures and share them with you sometime!",
            "speaker": "Emi",
            "date_time": "11.01.2024, 00:04:22",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:20"
        },
        {
            "clean_text": "As for my day, it was pretty standard, but I did try a new recipe for dinner, a Thai coconut curry. It turned out delicious, and it was a nice change of pace. Other than that, just some relaxing indoor activities with my cat. How about you? Anything exciting or new on your end today?",
            "speaker": "Emi",
            "date_time": "11.01.2024, 00:06:09",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:21"
        },
        {
            "clean_text": "Thai coconut curry sounds amazing! Cooking something new can be so rewarding. As for me, nothing too exciting today. Just the usual walk with Brad in Central Park and catching up on some reading.\nAlso I finally got around to organizing my bookshelf, so that felt productive.",
            "speaker": "Paola",
            "date_time": "11.01.2024, 00:09:32",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:22"
        },
        {
            "clean_text": "That sounds great!",
            "speaker": "Emi",
            "date_time": "11.01.2024, 00:12:57",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:23"
        },
        {
            "clean_text": "It was lovely chatting with you today Liza!",
            "speaker": "Emi",
            "date_time": "11.01.2024, 00:13:08",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:24"
        },
        {
            "clean_text": "I enjoyed talking to you too. Have a good night Bella!",
            "speaker": "Paola",
            "date_time": "11.01.2024, 00:14:36",
            "img_file": [],
            "img_url": [],
            "dia_id": "D4:25"
        }
    ],
    "events_session_5": {
        "agent_a": [
            {
                "sub-event": "Emi went to her nail appointment.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi tries a new recipe.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola started to read \"The Alchemist\" yesterday.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_6": [
        {
            "clean_text": "Hi there, Liza! How's your evening going?",
            "speaker": "Emi",
            "date_time": "11.01.2024, 22:17:12",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:1"
        },
        {
            "clean_text": "Hi Bella! I just came back home. I have been out all day from school to hanging out with my friends. What about you?",
            "speaker": "Paola",
            "date_time": "11.01.2024, 22:30:30",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:2"
        },
        {
            "clean_text": "Sounds like you had a busy day! I've had a relaxing evening so far, just catching up on some reading and thinking about travel plans. Speaking of which, have you ever been on a trip that left a lasting impression on you?",
            "speaker": "Emi",
            "date_time": "11.01.2024, 22:33:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:3"
        },
        {
            "clean_text": "Oh, definitely! One trip that stands out for me was a visit to Kyoto, Japan a couple of years ago. The city is so rich in culture and history, and I was mesmerized by the beautiful temples, serene gardens, and traditional tea ceremonies. It was like stepping back in time while enjoying the modern comforts of Japan. Have you had any memorable travel experiences?",
            "speaker": "Paola",
            "date_time": "11.01.2024, 22:58:46",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:4"
        },
        {
            "clean_text": "Kyoto sounds incredible! Japan has been on my travel bucket list for a while",
            "speaker": "Emi",
            "date_time": "11.01.2024, 23:01:34",
            "img_file": [
                "00000257-PHOTO-2024-01-11-23-00-41_opt.jpg",
                "00000257-PHOTO-2024-01-11-23-00-41.jpg"
            ],
            "img_url": [],
            "dia_id": "D5:6",
            "blip_caption": "there is a small pond in front of a building with a red roof"
        },
        {
            "clean_text": "One of my most memorable trips was to Santorini, Greece. The stunning sunsets over the caldera, the charming white washed buildings with blue domes, and the delicious Mediterranean cuisine left me in awe. It was like living in a postcard!",
            "speaker": "Emi",
            "date_time": "11.01.2024, 23:04:01",
            "img_file": [
                "00000260-PHOTO-2024-01-11-23-04-23.jpg",
                "00000260-PHOTO-2024-01-11-23-04-23_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D5:7",
            "blip_caption": "arafed view of a town with a blue dome church and a body of water"
        },
        {
            "clean_text": "Santorini sounds like a dream destination! Those iconic sunsets must have been breathtaking. Greece is on my list too; the history and beauty of the Mediterranean are so alluring.",
            "speaker": "Paola",
            "date_time": "11.01.2024, 23:12:33",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:9"
        },
        {
            "clean_text": "Do you have any travel destinations you're currently daydreaming about or planning for the future?",
            "speaker": "Paola",
            "date_time": "11.01.2024, 23:12:39",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:10"
        },
        {
            "clean_text": "Right now, I'm daydreaming about exploring the ancient ruins of Machu Picchu in Peru and experiencing the vibrant culture of Cusco. The idea of hiking through the Andes to reach the Lost City of the Incas is incredibly enticing. Have you ever considered a trip to South America?",
            "speaker": "Emi",
            "date_time": "11.01.2024, 23:14:26",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:11"
        },
        {
            "clean_text": "Machu Picchu is on my bucket list too! The history and mystique surrounding it are fascinating. South America has so much to offer in terms of natural beauty and culture. I haven't been there yet, but it's definitely on my radar.",
            "speaker": "Paola",
            "date_time": "11.01.2024, 23:16:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:12"
        },
        {
            "clean_text": "Are there any specific activities or places you'd like to explore when you visit Machu Picchu and Cusco?",
            "speaker": "Paola",
            "date_time": "11.01.2024, 23:17:15",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:13"
        },
        {
            "clean_text": "Oh, there's so much I'd love to do! Exploring the archaeological wonders of Machu Picchu, of course, and also trekking the Inca Trail to get there for a more immersive experience. In Cusco, I'd like to visit the historic sites like Sacsayhuamán and the Sacred Valley. And, of course, savoring the delicious Peruvian cuisine is a must!",
            "speaker": "Emi",
            "date_time": "11.01.2024, 23:21:17",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:14"
        },
        {
            "clean_text": "That sounds like an amazing itinerary! Trekking the Inca Trail must be a challenging yet incredibly rewarding adventure. And Peruvian cuisine is famous for its flavors and diversity.",
            "speaker": "Paola",
            "date_time": "11.01.2024, 23:31:41",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:15"
        },
        {
            "clean_text": "As for me, I've been daydreaming about visiting the Amalfi Coast in Italy, with its stunning coastal views and charming villages. Exploring the historic ruins of Pompeii nearby would also be on the list. Do you have any travel tips or recommendations for Italy?",
            "speaker": "Paola",
            "date_time": "11.01.2024, 23:31:43",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:16"
        },
        {
            "clean_text": "The Amalfi Coast is a fantastic choice, Liza! It's such a picturesque destination. When it comes to Italy, be sure to indulge in the local cuisine, especially the authentic pizza and pasta. Visiting iconic cities like Rome, Florence, and Venice is a must for their history and art. And if you have time, a day trip to the island of Capri from the Amalfi Coast is a wonderful experience. The Blue Grotto there is stunning",
            "speaker": "Emi",
            "date_time": "11.01.2024, 23:38:02",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:17"
        },
        {
            "clean_text": "Do you enjoy exploring historical sites and art when you travel?",
            "speaker": "Emi",
            "date_time": "11.01.2024, 23:38:26",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:18"
        },
        {
            "clean_text": "Thank you for the tips! Italian cuisine is indeed irresistible. Yes, I absolutely love exploring historical sites and art. It's like stepping back in time and immersing yourself in the culture and stories of a place. The art, architecture, and history all contribute to the richness of the travel experience. Do you have a favorite historical site or art piece that left a lasting impression on you during your travels?",
            "speaker": "Paola",
            "date_time": "11.01.2024, 23:40:13",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:19"
        },
        {
            "clean_text": "I completely agree, historical sites and art add such depth to a journey.  One of the most memorable art experiences for me was visiting the Louvre Museum in Paris and seeing the Mona Lisa up close. The sheer scale of the museum and the iconic artworks it houses are awe-inspiring. And of course, seeing the Mona Lisa, one of the most famous paintings in the world, was a special moment. How about you, Liza? Any historical site or artwork that left a lasting impression on your travels?",
            "speaker": "Emi",
            "date_time": "11.01.2024, 23:51:22",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:20"
        },
        {
            "clean_text": "Visiting the Louvre and seeing the Mona Lisa must have been an incredible experience! The Louvre is a treasure trove of art and history.",
            "speaker": "Paola",
            "date_time": "11.01.2024, 23:54:27",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:21"
        },
        {
            "clean_text": "One of the most unforgettable historical sites for me was the Great Wall of China. Standing on that ancient marvel and taking in the vast landscape was a surreal moment. It's a testament to human ingenuity and determination.",
            "speaker": "Paola",
            "date_time": "11.01.2024, 23:54:39",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:22"
        },
        {
            "clean_text": "And when it comes to art, I was deeply moved by Michelangelo's masterpiece, the Sistine Chapel ceiling in Vatican City. The sheer beauty and intricacy of the frescoes are beyond words.",
            "speaker": "Paola",
            "date_time": "11.01.2024, 23:54:56",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:23"
        },
        {
            "clean_text": "Both the Great Wall of China and the Sistine Chapel are iconic and awe-inspiring in their own right. Standing on the Great Wall and gazing at the vastness of it must have been a surreal experience, and the Sistine Chapel's artistry is indeed breathtaking.",
            "speaker": "Emi",
            "date_time": "11.01.2024, 23:57:10",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:24"
        },
        {
            "clean_text": "It's remarkable how these historical sites and artworks can leave us with lasting memories and a deep appreciation for human creativity and achievements. Since we're talking about travel and exploration, is there a specific place or destination you've been curious about lately, or perhaps a unique travel experience you'd love to have in the future?",
            "speaker": "Emi",
            "date_time": "11.01.2024, 23:58:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:25"
        },
        {
            "clean_text": "Lately, I've been intrigued by the idea of exploring the ancient ruins of Petra in Jordan. The rose-red city carved into the cliffs looks like something out of a fairy tale. The history and architectural marvels there are so captivating. Have you ever considered visiting Petra or any other Middle Eastern destinations?",
            "speaker": "Paola",
            "date_time": "12.01.2024, 00:00:37",
            "img_file": [],
            "img_url": [],
            "dia_id": "D5:26"
        }
    ],
    "events_session_6": {
        "agent_a": [
            {
                "sub-event": "Emi wants to visit Machu Picchu in Peru.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Poala wants to visit the Amalfi Coast in Italy.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Poala wants to visit Petra in Jordan.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola was hanging out with her friends.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_7": [
        {
            "clean_text": "Petra in Jordan does look like a place straight out of a fairy tale! The intricate rock-cut architecture and the rich history make it an incredibly intriguing destination. I haven't been to the Middle East yet, but it's definitely on my list. Exploring ancient cities like Petra and experiencing the unique culture of the region would be a dream come true.",
            "speaker": "Emi",
            "date_time": "13.01.2024, 14:51:05",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:1"
        },
        {
            "clean_text": "Speaking of unique travel experiences, have you ever considered going on a wildlife safari? It's something I've always wanted to do, especially in Africa, to see the magnificent animals in their natural habitat.",
            "speaker": "Emi",
            "date_time": "13.01.2024, 14:52:25",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:2"
        },
        {
            "clean_text": "A wildlife safari sounds like an incredible adventure! Witnessing the beauty and majesty of African wildlife in its natural habitat must be awe-inspiring. Africa is known for its diverse ecosystems and unique species. Going on a safari is definitely on my travel wishlist too.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 14:55:02",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:3"
        },
        {
            "clean_text": "Do you have a specific African safari destination in mind that you'd love to visit?",
            "speaker": "Paola",
            "date_time": "13.01.2024, 14:55:11",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:4"
        },
        {
            "clean_text": "There are so many amazing safari destinations in Africa, but if I had to pick one, it would probably be the Serengeti National Park in Tanzania. The annual Great Migration of wildebeests and zebras, along with the predators that follow them, is a natural spectacle like no other. How about you, Liza? Is there a particular safari destination or wildlife encounter you've been curious about?",
            "speaker": "Emi",
            "date_time": "13.01.2024, 14:57:56",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:5"
        },
        {
            "clean_text": "The Serengeti National Park sounds like an incredible choice! Witnessing the Great Migration must be a breathtaking experience. Tanzania is indeed known for its rich wildlife.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 14:59:54",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:6"
        },
        {
            "clean_text": "As for me, I've always been fascinated by the idea of going on a gorilla trekking adventure in Rwanda or Uganda. Getting up close to these magnificent creatures in their natural habitat is a once-in-a-lifetime opportunity.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:00:16",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:7"
        },
        {
            "clean_text": "Gorilla trekking is a fantastic choice! Rwanda and Uganda offer a unique chance to observe these gentle giants up close. It's a conservation success story and a truly humbling experience to share the same environment with them. Plus, the lush landscapes of the region are breathtaking. Is there a specific animal or wildlife encounter that you're most excited about when it comes to gorilla trekking?",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:08:20",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:8"
        },
        {
            "clean_text": "Absolutely, the chance to see mountain gorillas in their natural habitat is what excites me the most. These intelligent and magnificent creatures share a close genetic connection with humans, and observing their behavior and social interactions must be a profound experience. Plus, the mountainous terrain of Rwanda and Uganda adds to the adventure.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:12:16",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:9"
        },
        {
            "clean_text": "Have you ever had a close encounter with wildlife during your travels, Bella?",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:12:28",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:10"
        },
        {
            "clean_text": "I've had some close encounters with wildlife, but nothing as extraordinary as gorilla trekking. During a trip to Costa Rica, I had the chance to see a variety of exotic animals like monkeys, sloths, and colorful birds in the rainforests. It was amazing to observe them in their natural habitat, but gorilla trekking is definitely a different level of experience. Since we're talking about travel dreams, is there a specific travel memory that stands out as your all-time favorite, Liza? Something that left an indelible mark on your heart?",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:15:27",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:11"
        },
        {
            "clean_text": "That sounds like an incredible experience in Costa Rica! Rainforests are teeming with biodiversity, and seeing these animals in their natural habitat is a true privilege.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:20:32",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:12"
        },
        {
            "clean_text": "My all-time favorite travel memory has to be my visit to the Grand Canyon in the USA. Standing at the edge of that vast, breathtaking chasm and gazing into the layers of ancient rock formations was a humbling and awe-inspiring moment. The sheer scale and beauty of the Grand Canyon are beyond words.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:20:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:13"
        },
        {
            "clean_text": "The Grand Canyon is indeed a natural wonder like no other. Its immense size and the intricate colors and patterns in the rock formations create a mesmerizing landscape. It's one of those places that can leave you feeling incredibly small in the face of nature's grandeur. Travel has a way of giving us these unforgettable moments and memories that stay with us for a lifetime. It's what makes it such a rewarding and enriching experience.",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:22:09",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:14"
        },
        {
            "clean_text": "Absolutely, travel has a unique way of humbling us and connecting us with the world's wonders. It's a reminder of the beauty and diversity of our planet. I couldn't agree more about its enriching nature.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:24:14",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:15"
        },
        {
            "clean_text": "Since we've been talking about diverse destinations and experiences, is there a place or activity on your travel bucket list that you'd describe as your ultimate dream?",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:25:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:16"
        },
        {
            "clean_text": "My ultimate dream travel experience would be to witness the Northern Lights, also known as the Aurora Borealis. The idea of standing beneath the dancing colors in the Arctic night sky is nothing short of magical. It's like a natural light show that's both beautiful and mysterious.",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:26:21",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:17"
        },
        {
            "clean_text": "How about you, Liza? Is there a travel dream you hold dear, something you've always wanted to do but haven't had the chance yet?",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:27:17",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:18"
        },
        {
            "clean_text": "Witnessing the Northern Lights is a dream of mine too! The ethereal beauty of those dancing lights in the Arctic skies is mesmerizing. It's an experience that feels almost otherworldly.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:30:47",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:19"
        },
        {
            "clean_text": "One of my long-held travel dreams is to explore the ancient temples of Angkor Wat in Cambodia. The intricate architecture and rich history of that complex are truly captivating. It's a place steeped in spirituality and culture.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:31:39",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:20"
        },
        {
            "clean_text": "Well, I hope both of our travel dreams come true someday, Bella. It's been a pleasure discussing travel and sharing these dreams with you.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:33:11",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:21"
        },
        {
            "clean_text": "Is there anything else on your mind or any new interests or hobbies you've picked up recently?",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:34:01",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:22"
        },
        {
            "clean_text": "Exploring the ancient temples of Angkor Wat in Cambodia sounds like an incredible journey into history and spirituality. I have no doubt that it would be an unforgettable experience for you.",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:40:54",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:23"
        },
        {
            "clean_text": "As for me, I've been delving into learning a new language recently. I've always been fascinated by different cultures, and I thought learning a new language would be a great way to connect with people from around the world on a deeper level. It's challenging but incredibly rewarding.",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:42:09",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:24"
        },
        {
            "clean_text": "How about you, Liza? Have you explored any new interests or hobbies lately?",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:42:24",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:25"
        },
        {
            "clean_text": "Learning a new language is a fantastic endeavor! It not only opens up opportunities for communication but also offers insights into different cultures and ways of thinking. Which language are you learning, if you don't mind me asking?",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:45:26",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:26"
        },
        {
            "clean_text": "As for me, I've been dabbling in photography. I find it fascinating to capture moments and scenes, especially when I travel. It's a way to freeze time and preserve memories.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:47:26",
            "img_file": [
                "00000308-PHOTO-2024-01-13-15-47-40.jpg",
                "00000308-PHOTO-2024-01-13-15-47-40_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D6:27",
            "blip_caption": "sunset over a lake with a boat docked in the water"
        },
        {
            "clean_text": "I'm currently learning Spanish. It's such a widely spoken language, and it will be helpful for travel and connecting with Spanish-speaking communities.",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:48:22",
            "img_file": [
                "00000309-PHOTO-2024-01-13-15-48-04_opt.jpg",
                "00000309-PHOTO-2024-01-13-15-48-04.jpg"
            ],
            "img_url": [],
            "dia_id": "D6:30",
            "blip_caption": "there is a river with rocks in it and a mountain in the background"
        },
        {
            "clean_text": "Here are some pictures I have taken. Do you like them?",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:48:27",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:31"
        },
        {
            "clean_text": "Photography is a wonderful hobby! It allows you to capture the beauty and essence of the places you visit. Do you have any favorite subjects or types of photography you enjoy?",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:49:32",
            "img_file": [
                "00000312-PHOTO-2024-01-13-15-49-03_opt.jpg",
                "00000312-PHOTO-2024-01-13-15-49-03.jpg"
            ],
            "img_url": [],
            "dia_id": "D6:33",
            "blip_caption": "someone is reading a book on a bed with a white sheet"
        },
        {
            "clean_text": "That looks absolutely amazing! You're very talented Liza.",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:49:53",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:34"
        },
        {
            "clean_text": "Learning Spanish is a fantastic choice! It's not only a beautiful language but also incredibly useful for travel and cultural immersion.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:51:28",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:35"
        },
        {
            "clean_text": "As for photography, I enjoy capturing landscapes and street photography. Landscapes because they showcase the natural beauty of a place, and street photography because it's a way to capture the daily life and culture of the people.",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:52:01",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:36"
        },
        {
            "clean_text": "Landscapes and street photography offer different but equally captivating perspectives of a destination. Landscapes showcase the grandeur of nature, while street photography tells the stories of people and their everyday lives. It's a wonderful way to document your travels and share the world's beauty with others.",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:55:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:37"
        },
        {
            "clean_text": "Well, Liza, it's been a delightful conversation, discussing everything from travel dreams to hobbies. I've truly enjoyed our chat. If you ever want to talk more or share travel stories and photos, feel free to reach out.",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:56:05",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:38"
        },
        {
            "clean_text": "I've enjoyed our conversation as well, Bella! It's been a pleasure getting to know you and sharing our interests and dreams. I'll definitely keep that in mind, and I'd love to hear more about your language learning and see your travel photos. Have a wonderful evening!",
            "speaker": "Paola",
            "date_time": "13.01.2024, 15:58:08",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:39"
        },
        {
            "clean_text": "You too, Liza! Have a fantastic evening, and I look forward to our future conversations. Take care!",
            "speaker": "Emi",
            "date_time": "13.01.2024, 15:59:25",
            "img_file": [],
            "img_url": [],
            "dia_id": "D6:40"
        }
    ],
    "events_session_7": {
        "agent_a": [
            {
                "sub-event": "Emi wants to visit the Serengeti National Park in Tanzania.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi has been delving into learning Spanish recently.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola wants to go on a gorilla trekking adventure.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola has been dabbling in photography.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_8": [
        {
            "clean_text": "Hey Liza! How are you? What have you been up to today?",
            "speaker": "Emi",
            "date_time": "14.01.2024, 23:36:33",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:1"
        },
        {
            "clean_text": "Hey Bella! I am a bit sick today. Caught a flu most likely yesterday, because I went out without my coat. Now I am hanging out with friends. We are playing truth or dare. What about you? How is your day going?",
            "speaker": "Paola",
            "date_time": "14.01.2024, 23:39:54",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:2"
        },
        {
            "clean_text": "Oh no! I'm sorry to hear that you're not feeling well. Make sure to rest and drink plenty of fluids to help you recover. As for me, I've had a pretty good day so far. I went for a morning hike, and now I'm just relaxing at home. Truth or dare sounds like fun though! What kind of dares have you and your friends been doing?",
            "speaker": "Emi",
            "date_time": "14.01.2024, 23:48:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:3"
        },
        {
            "clean_text": "Thanks, Bella! I'll definitely take it easy. Well, we've had some interesting dares today. My friend dared me to eat a spoonful of hot sauce, which was intense, to say the least! Then, someone had to call their crush and sing a love song. It got really hilarious when they couldn't hit the high notes! How about you? Any interesting plans for the evening?",
            "speaker": "Paola",
            "date_time": "14.01.2024, 23:51:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:4"
        },
        {
            "clean_text": "Haha, those dares sound like a lot of fun! I can only imagine how entertaining it must have been to watch your friend try to sing that love song. As for my evening, I'm planning to watch a movie and maybe do a bit of reading. It's a pretty relaxed night for me. Do you have any movie recommendations or favorite books you'd like to share? I'm always looking for something new to watch or read.",
            "speaker": "Emi",
            "date_time": "14.01.2024, 23:53:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:5"
        },
        {
            "clean_text": "That sounds like a perfect way to unwind, Bella! For movies, have you seen \"The Shawshank Redemption\"? It's a classic and definitely worth watching if you haven't already. And as for books, I recently enjoyed \"Where the Crawdads Sing\" by Delia Owens. It's a beautifully written novel set in the marshes of North Carolina with a mix of mystery and romance. Highly recommend both!\nWhat genre are you in the mood for tonight?",
            "speaker": "Paola",
            "date_time": "14.01.2024, 23:55:06",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:6"
        },
        {
            "clean_text": "\"The Shawshank Redemption\" is a classic indeed, and I haven't seen it in a while, so that might be a great choice for tonight. And \"Where the Crawdads Sing\" sounds intriguing; I'll definitely check it out. I'm in the mood for a good drama or maybe a mystery tonight. Do you have any favorite movies or books in those genres that you'd like to suggest?",
            "speaker": "Emi",
            "date_time": "14.01.2024, 23:56:28",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:7"
        },
        {
            "clean_text": "By the way, I got a new dog!",
            "speaker": "Emi",
            "date_time": "14.01.2024, 23:58:17",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:8"
        },
        {
            "clean_text": "You're welcome, Bella! If you're in the mood for drama, I'd recommend \"A Beautiful Mind.\" It's a compelling biographical drama about the mathematician John Nash, and it's quite thought-provoking. For mystery, \"Gone Girl\" by Gillian Flynn is a gripping novel with unexpected twists and turns. The movie adaptation is also excellent.",
            "speaker": "Paola",
            "date_time": "14.01.2024, 23:59:17",
            "img_file": [
                "00000329-PHOTO-2024-01-14-23-59-01.jpg",
                "00000329-PHOTO-2024-01-14-23-59-01_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D7:10",
            "blip_caption": "there is a dog that is sitting on the grass in the park"
        },
        {
            "clean_text": "I hope you enjoy whichever one you choose! What's your dog's name, by the way?",
            "speaker": "Paola",
            "date_time": "14.01.2024, 23:59:26",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:11"
        },
        {
            "clean_text": "Those are excellent suggestions, Liza! \"A Beautiful Mind\" and \"Gone Girl\" are both on my to-watch and to-read lists, so I appreciate the recommendations.",
            "speaker": "Emi",
            "date_time": "14.01.2024, 23:59:59",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:12"
        },
        {
            "clean_text": "My dog's name is Max! He's a lovable golden retriever, always full of energy and ready for a good hike.",
            "speaker": "Emi",
            "date_time": "15.01.2024, 00:00:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:13"
        },
        {
            "clean_text": "By the way, if you could have any superpower, what would it be?",
            "speaker": "Emi",
            "date_time": "15.01.2024, 00:00:36",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:14"
        },
        {
            "clean_text": "Max sounds like a wonderful companion, Bella! As for superpowers, that's a fun question! If I could have any superpower, I think I'd choose the ability to teleport. It would make traveling so much easier and more convenient, plus I could visit friends and family all over the world without any hassle. How about you? What superpower would you pick?",
            "speaker": "Paola",
            "date_time": "15.01.2024, 00:01:56",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:15"
        },
        {
            "clean_text": "Teleportation would be such a handy superpower! No more long flights or traffic jams. If I could choose a superpower, I think I'd go with the ability to time travel. It would be amazing to explore different time periods, learn about history firsthand, and maybe even make small changes to improve the world. Of course, I'd have to be careful not to mess up the timeline too much! What era or event in history would you like to visit if you could time travel?",
            "speaker": "Emi",
            "date_time": "15.01.2024, 00:04:29",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:16"
        },
        {
            "clean_text": "Time travel would be fascinating, Bella! Just imagine witnessing significant historical moments. If I could choose, I'd love to visit the Roaring Twenties. The Jazz Age, flapper fashion, and the energy of that era seem like a lot of fun.",
            "speaker": "Paola",
            "date_time": "15.01.2024, 00:06:56",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:17"
        },
        {
            "clean_text": "Plus, it would be interesting to see how life was during the Prohibition era and all the secret speakeasies. What about you? Any specific historical period that piques your interest?",
            "speaker": "Paola",
            "date_time": "15.01.2024, 00:07:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:18"
        },
        {
            "clean_text": "The Roaring Twenties would be an incredible choice! The fashion, music, and cultural changes of that time were truly iconic. Visiting the speakeasies and experiencing the lively atmosphere would be a blast. As for me, I've always been intrigued by the Renaissance period. The flourishing of art, science, and culture during that time in places like Florence and Venice must have been awe-inspiring. Meeting artists like Leonardo da Vinci or witnessing the works of Michelangelo would be a dream come true.",
            "speaker": "Emi",
            "date_time": "15.01.2024, 00:08:33",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:19"
        },
        {
            "clean_text": "Speaking of dreams, do you have any bucket list destinations you'd love to visit in the future?",
            "speaker": "Emi",
            "date_time": "15.01.2024, 00:08:37",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:20"
        },
        {
            "clean_text": "The Renaissance era is a fantastic choice, Bella! Meeting those brilliant minds and witnessing their creations would be an unforgettable experience.",
            "speaker": "Paola",
            "date_time": "15.01.2024, 00:11:38",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:21"
        },
        {
            "clean_text": "Oh, absolutely! I'd love to visit Santorini in Greece for its breathtaking views and stunning sunsets. Machu Picchu in Peru has always intrigued me for its historical significance and mysterious atmosphere. And a trip to Japan to immerse myself in its rich culture and enjoy the cherry blossoms is definitely on my list. How about you? Any dream destinations you've been longing to see?",
            "speaker": "Paola",
            "date_time": "15.01.2024, 00:12:56",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:22"
        },
        {
            "clean_text": "This picture was captured by my friend this summer and it made me so jealous. I would love to see the sunset and sunrise in Santorini.",
            "speaker": "Paola",
            "date_time": "15.01.2024, 00:13:30",
            "img_file": [
                "00000343-PHOTO-2024-01-15-00-13-16_opt.jpg",
                "00000343-PHOTO-2024-01-15-00-13-16.jpg"
            ],
            "img_url": [],
            "dia_id": "D7:24",
            "blip_caption": "arafed view of a blue dome church with a blue roof"
        },
        {
            "clean_text": "Those destinations all sound incredible! Santorini's beauty especially! But also, Machu Picchu's history, and Japan's culture would make for amazing experiences. I've always dreamed of visiting the Amalfi Coast in Italy for its picturesque landscapes and delicious cuisine. The Northern Lights in Norway is another bucket list item for me; witnessing the auroras dancing across the sky must be breathtaking. And finally, I'd love to explore the ancient wonders of Egypt, like the pyramids and the temples along the Nile. Traveling the world and experiencing its diverse cultures and natural wonders is definitely something I hope to do in the future!",
            "speaker": "Emi",
            "date_time": "15.01.2024, 00:14:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:25"
        },
        {
            "clean_text": "Bella, your travel bucket list sounds absolutely amazing! The Amalfi Coast, the Northern Lights, and the wonders of Egypt are all incredible choices. Italy's cuisine is renowned, and witnessing the Northern Lights is on many people's wish list. Egypt's historical sites are truly awe-inspiring.",
            "speaker": "Paola",
            "date_time": "15.01.2024, 00:16:50",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:26"
        },
        {
            "clean_text": "Exploring diverse cultures and natural wonders around the world is a fantastic goal. Traveling can be such a enriching experience.",
            "speaker": "Paola",
            "date_time": "15.01.2024, 00:17:02",
            "img_file": [],
            "img_url": [],
            "dia_id": "D7:27"
        }
    ],
    "events_session_8": {
        "agent_a": [
            {
                "sub-event": "Emi plans to watch a movie and read a book.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi got a new dog.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola caught the flu.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola hangs out with friends and plays truth or dare.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_9": [
        {
            "clean_text": "Hi there, Bella! How's your evening going?",
            "speaker": "Paola",
            "date_time": "15.01.2024, 22:06:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:1"
        },
        {
            "clean_text": "Hi Liza! I'm good, and you? What have you been up to today?",
            "speaker": "Emi",
            "date_time": "15.01.2024, 22:07:10",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:2"
        },
        {
            "clean_text": "I'm doing well, Bella! I had a relaxing day catching up on some reading and spending time with my dog.",
            "speaker": "Paola",
            "date_time": "15.01.2024, 22:08:37",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:3"
        },
        {
            "clean_text": "That's great! Speaking of reading, have you started reading \"Where the Crawdads Sing\" yet? I remember you mentioned you were interested in checking it out. If so, what do you think of it so far?",
            "speaker": "Emi",
            "date_time": "15.01.2024, 22:09:05",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:4"
        },
        {
            "clean_text": "Yes, I did start reading \"Where the Crawdads Sing,\" and I'm absolutely hooked! Delia Owens' writing style is captivating, and the way she describes the natural setting in the marshes of North Carolina is beautiful. The mystery element has me intrigued, too. I can't wait to see how it unfolds. Have you come across any new books recently that you've enjoyed?",
            "speaker": "Paola",
            "date_time": "15.01.2024, 22:11:16",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:5"
        },
        {
            "clean_text": "I'm glad to hear you're enjoying \"Where the Crawdads Sing\"! Delia Owens' descriptive writing really does bring the setting to life. As for me, I recently finished reading a beautiful romantic novel called \"Me Before You\" by Jojo Moyes. It's a touching love story between Louisa Clark and Will Traynor, filled with heartwarming moments and thought-provoking themes. If you're in the mood for a heartfelt romance, I highly recommend it.",
            "speaker": "Emi",
            "date_time": "15.01.2024, 22:12:32",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:6"
        },
        {
            "clean_text": "\"Me Before You\" sounds like a wonderful choice for a romantic read. I'll definitely add it to my list. It's amazing how a well-written love story can tug at your heartstrings and leave a lasting impression.",
            "speaker": "Paola",
            "date_time": "15.01.2024, 22:15:04",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:7"
        },
        {
            "clean_text": "Absolutely, Liza! Well-crafted romantic novels have that special ability to capture our emotions and transport us into the lives of the characters. If you decide to read it, I hope you enjoy it as much as I did.",
            "speaker": "Emi",
            "date_time": "15.01.2024, 22:16:09",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:8"
        },
        {
            "clean_text": "I'm sure I will, Bella. Thank you for the recommendation! Have you come across any other memorable romantic novels lately?",
            "speaker": "Paola",
            "date_time": "15.01.2024, 22:17:27",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:9"
        },
        {
            "clean_text": "Another romantic novel I read recently and loved is \"The Rosie Project\" by Graeme Simsion. It's a heartwarming and humorous story about a genetics professor, Don Tillman, who embarks on a project to find the perfect partner. His journey is both touching and entertaining, and it's a delightful exploration of love and human connection.",
            "speaker": "Emi",
            "date_time": "15.01.2024, 22:20:14",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:10"
        },
        {
            "clean_text": "\"The Rosie Project\" sounds like a delightful read, Bella! I appreciate the recommendation. It's always nice to have a selection of romantic novels to choose from when I'm in the mood for a love story. Thank you for sharing these with me!",
            "speaker": "Paola",
            "date_time": "15.01.2024, 22:22:21",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:11"
        },
        {
            "clean_text": "You're very welcome, Liza! I'm always happy to share book recommendations, especially when they involve heartwarming stories. Let me know what you think if you decide to read any of them.",
            "speaker": "Emi",
            "date_time": "15.01.2024, 22:23:33",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:12"
        },
        {
            "clean_text": "I will, Bella! It's been lovely chatting with you about books and literature. Is there anything else exciting happening in your life these days?",
            "speaker": "Paola",
            "date_time": "15.01.2024, 22:25:35",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:13"
        },
        {
            "clean_text": "Well, aside from diving into good books, I've been exploring some new hiking trails in Idaho, where I'm visiting my aunt. The winter scenery is absolutely breathtaking, and it's a refreshing way to get some exercise and enjoy the outdoors. How about you, any interesting activities or plans on your end?",
            "speaker": "Emi",
            "date_time": "15.01.2024, 22:26:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:14"
        },
        {
            "clean_text": "As for me, I've been focusing on some home improvement projects lately. I'm redecorating my living room, and it's been a fun and creative process. I can't wait to see the final result.",
            "speaker": "Paola",
            "date_time": "15.01.2024, 22:30:32",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:15"
        },
        {
            "clean_text": "That sounds like an amazing adventure, Bella! Idaho must be a beautiful place for winter hiking. I'm curious, have you discovered any favorite spots or hidden gems during your time there? I'd love to hear more about your experiences exploring Idaho's trails!",
            "speaker": "Paola",
            "date_time": "15.01.2024, 22:30:35",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:16"
        },
        {
            "clean_text": "Oh, absolutely, Liza! Idaho has some incredible hiking destinations. I've had the pleasure of exploring the scenic trails in the Sawtooth National Recreation Area, and it's been a treat. The snowy mountains and frozen lakes create a picturesque winter wonderland. If you ever have the chance, I'd highly recommend visiting this area for a hiking adventure.",
            "speaker": "Emi",
            "date_time": "15.01.2024, 22:31:26",
            "img_file": [
                "00000365-PHOTO-2024-01-15-22-31-44.jpg",
                "00000365-PHOTO-2024-01-15-22-31-44_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D8:17",
            "blip_caption": "skiers taking a picture of a group of people on a snowy trail"
        },
        {
            "clean_text": "The Sawtooth National Recreation Area sounds like a dream, Bella! I'll definitely keep it in mind for future travel plans. It's wonderful to hear about your outdoor adventures. Enjoy your time in Idaho, and stay safe on those beautiful trails!",
            "speaker": "Paola",
            "date_time": "15.01.2024, 22:34:18",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:19"
        },
        {
            "clean_text": "Thank you! Will do!",
            "speaker": "Emi",
            "date_time": "15.01.2024, 22:34:55",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:20"
        }
    ],
    "events_session_9": {
        "agent_a": [
            {
                "sub-event": "Emi finished reading the novel \"Me Before You\" by Jojo Moyes.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi recently read the \"The Rosie Project\" by Graeme Simsion.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi has been exploring some new hiking trails in Idaho.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola started to read the \"Where the Crawdads Sing\".",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola redecorates her living room.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_10": [
        {
            "clean_text": "Hey Liza! How are you today?",
            "speaker": "Emi",
            "date_time": "17.01.2024, 01:56:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:21"
        },
        {
            "clean_text": "Hey Bella! I'm doing great, thanks for asking. Just laying watching a tv show. How about you? How's your day going so far?",
            "speaker": "Paola",
            "date_time": "17.01.2024, 01:58:35",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:22"
        },
        {
            "clean_text": "I'm doing well also! Today I travelled from Idaho back to Los Angeles. It's been quite a journey, and I'm always fascinated by the different places and experiences that travel brings. Have you been on any interesting journeys lately, or do you have any travel plans in the near future?",
            "speaker": "Emi",
            "date_time": "17.01.2024, 02:02:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:23"
        },
        {
            "clean_text": "That sounds like quite the adventure, Bella! Traveling always has a way of opening up new experiences and perspectives. I haven't been on any journeys recently, but I'm actually planning a road trip through the southwestern USA in a couple of months. I'm really looking forward to exploring the diverse landscapes and natural beauty that region has to offer. Have you ever been to the southwestern USA?",
            "speaker": "Paola",
            "date_time": "17.01.2024, 02:05:38",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:24"
        },
        {
            "clean_text": "Your upcoming road trip through the southwestern USA sounds exciting. I've been to a few places in the Southwest, and it's absolutely stunning. The diverse landscapes, from the deserts to the canyons, are truly captivating. If you need any recommendations or tips for your trip, feel free to ask. I hope you have a fantastic time exploring the natural beauty of the region!",
            "speaker": "Emi",
            "date_time": "17.01.2024, 02:07:39",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:25"
        },
        {
            "clean_text": "I appreciate your offer of recommendations and tips. It's great to hear that you've explored some of the Southwest already, and those places you mentioned sound incredible. Speaking of diverse landscapes, have you ever considered visiting the Pacific Northwest? It's known for its lush forests, rugged coastline, and vibrant cities like Seattle and Portland. It's a completely different experience from the Southwest, but equally captivating in its own way.",
            "speaker": "Paola",
            "date_time": "17.01.2024, 02:10:39",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:26"
        },
        {
            "clean_text": "The Pacific Northwest is indeed a region that has piqued my interest. I've heard so much about its lush greenery, dramatic coastline, and the vibrant culture of cities like Seattle and Portland. It's on my list of places to explore in the future. Have you had the chance to visit the Pacific Northwest yourself? If so, any favorite spots or recommendations for someone planning a trip there?",
            "speaker": "Emi",
            "date_time": "17.01.2024, 02:11:42",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:27"
        },
        {
            "clean_text": "I've had the opportunity to visit the Pacific Northwest a couple of times, and it's truly a captivating region. If you love nature, you'll be amazed by the beauty of places like Olympic National Park with its lush rainforests and rugged coastline, or the breathtaking Multnomah Falls in Oregon. Seattle's Pike Place Market is a must-visit for its vibrant atmosphere and fresh seafood, and you can't miss exploring the vibrant neighborhoods of Portland, known for its food scene and unique culture. The Pacific Northwest has so much to offer, and I'm sure you'll have an amazing time exploring it when you get the chance!",
            "speaker": "Paola",
            "date_time": "17.01.2024, 02:13:25",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:28"
        },
        {
            "clean_text": "Your descriptions make me even more excited about the prospect of visiting the Pacific Northwest! It sounds like a region filled with natural beauty and vibrant urban experiences. Speaking of travel, when you visited the Pacific Northwest, did you find it necessary to pack specific clothing or gear given the diverse weather and outdoor activities? I've heard it can be quite rainy there, so I imagine having the right outfits and gear is essential. Any tips on what to pack for a trip to the region?",
            "speaker": "Emi",
            "date_time": "17.01.2024, 02:16:07",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:29"
        },
        {
            "clean_text": "Packing for the Pacific Northwest requires a bit of preparation due to its variable weather. It's known for its rainfall, especially during the fall and winter months. I'd recommend bringing a good quality waterproof jacket and sturdy, comfortable hiking boots if you plan on exploring the outdoors. Layered clothing is a must, as the weather can change quickly.",
            "speaker": "Paola",
            "date_time": "17.01.2024, 02:18:02",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:30"
        },
        {
            "clean_text": "For the cities like Seattle and Portland, casual and comfortable clothing is the norm. Don't forget to pack an umbrella or a good raincoat, as it can come in handy. And of course, a good pair of walking shoes for exploring the vibrant neighborhoods and markets.",
            "speaker": "Paola",
            "date_time": "17.01.2024, 02:18:13",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:31"
        },
        {
            "clean_text": "Also, if you plan to visit any of the national parks in the region, it's a good idea to check for any specific gear requirements or recommendations for those areas. Being prepared for various weather conditions will ensure you have a comfortable and enjoyable trip!",
            "speaker": "Paola",
            "date_time": "17.01.2024, 02:18:20",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:32"
        },
        {
            "clean_text": "Thank you so much for the detailed packing tips, Liza! It's clear that being prepared for the variable weather is key to having a great trip in the Pacific Northwest. I'll definitely make sure to pack accordingly, including that waterproof jacket and comfortable hiking boots. It sounds like you've had your fair share of travel experiences, and your insights are incredibly helpful.",
            "speaker": "Emi",
            "date_time": "17.01.2024, 02:19:15",
            "img_file": [],
            "img_url": [],
            "dia_id": "D8:33"
        }
    ],
    "events_session_10": {
        "agent_a": [
            {
                "sub-event": "Emi travelled from Idaho back to Los Angeles.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola is planning a road trip through the southwestern USA.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_11": [
        {
            "clean_text": "Hey Liza! How are you today?",
            "speaker": "Emi",
            "date_time": "17.01.2024, 17:05:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:1"
        },
        {
            "clean_text": "Hello Bella! I am fine just going home from school now. Quite a cold day here today. What about you? How are you? T",
            "speaker": "Paola",
            "date_time": "17.01.2024, 17:06:41",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:2"
        },
        {
            "clean_text": "I'm doing well, thank you for asking! It's also pretty cold here today, but I'm cozy indoors. How was your day at school? Anything interesting happen?",
            "speaker": "Emi",
            "date_time": "17.01.2024, 17:07:58",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:3"
        },
        {
            "clean_text": "My day was good, thank you! Well, we had a surprise quiz in math class, which was a bit unexpected. But other than that, it was a typical school day. How about you? Anything exciting happening on your end?",
            "speaker": "Paola",
            "date_time": "17.01.2024, 17:09:19",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:4"
        },
        {
            "clean_text": "Oh, a surprise quiz can definitely be challenging! As for me, nothing too exciting today. I've been working on some projects and catching up on a bit of reading. Any plans for the evening once you get home?",
            "speaker": "Emi",
            "date_time": "17.01.2024, 17:10:02",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:5"
        },
        {
            "clean_text": "Sounds like a productive day for you! When I get home, I'll probably finish up some homework, and then I might watch a movie or read a book. Just some relaxation after a long day at school. How about you? Any fun plans for the evening?",
            "speaker": "Paola",
            "date_time": "17.01.2024, 17:12:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:6"
        },
        {
            "clean_text": "That sounds like a nice way to unwind! As for me, I will cook a special dinner and spend some time practicing the guitar. It's always a great way to relax and unwind. Do you play any musical instruments?",
            "speaker": "Emi",
            "date_time": "17.01.2024, 17:20:13",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:7"
        },
        {
            "clean_text": "I decided on cooking some stake",
            "speaker": "Emi",
            "date_time": "17.01.2024, 17:21:41",
            "img_file": [
                "00000388-PHOTO-2024-01-17-17-21-28_opt.jpg",
                "00000388-PHOTO-2024-01-17-17-21-28.jpg"
            ],
            "img_url": [],
            "dia_id": "D9:9",
            "blip_caption": "there are two steaks cooking on a grill with foil on it"
        },
        {
            "clean_text": "Cooking and playing the guitar, that sounds like a wonderful evening! I used to play the piano when I was younger, but I haven't practiced in a while. I should probably dust it off one of these days and start playing again. Do you enjoy playing the guitar?",
            "speaker": "Paola",
            "date_time": "17.01.2024, 17:23:35",
            "img_file": [
                "00000391-PHOTO-2024-01-17-17-23-45_opt.jpg",
                "00000391-PHOTO-2024-01-17-17-23-45.jpg"
            ],
            "img_url": [],
            "dia_id": "D9:10",
            "blip_caption": "there is a plate of food with rice, meat, and vegetables on it"
        },
        {
            "clean_text": "I am eating some rice and vegetables I made yesterday for dinner. I felt really tired to cook something else now.",
            "speaker": "Paola",
            "date_time": "17.01.2024, 17:24:21",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:12"
        },
        {
            "clean_text": "Playing the piano must have been a great experience! I do enjoy playing the guitar; it's a fantastic way to express myself and unwind. I find it quite therapeutic to strum the strings and lose myself in the melodies. There's something incredibly soothing about the sound of acoustic chords resonating in the room. It's like a form of meditation for me.\nRegarding your piano playing, it's never too late to reignite a passion for music. Music has this incredible ability to stay with us, even when we take a break from playing. Rediscovering the piano could be a wonderful journey for you. It might feel a bit rusty at first, but the joy of creating beautiful music and the sense of accomplishment that comes with it are truly worth the effort.",
            "speaker": "Emi",
            "date_time": "17.01.2024, 17:24:36",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:13"
        },
        {
            "clean_text": "I totally get you!",
            "speaker": "Emi",
            "date_time": "17.01.2024, 17:24:49",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:14"
        },
        {
            "clean_text": "You're absolutely right! I think I'll take your advice and start playing the piano again. It's a beautiful instrument, and I miss the joy it brought me. Thanks for the encouragement! What type of music do you like to play on your guitar?",
            "speaker": "Paola",
            "date_time": "17.01.2024, 17:26:08",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:15"
        },
        {
            "clean_text": "You're welcome Liza! I'm glad to hear you're considering getting back into playing the piano. As for the guitar, I find myself drawn to a diverse array of musical styles, but there's something about folk and acoustic music that speaks to my soul in a profound way. The simplicity and purity of acoustic guitar chords, combined with heartfelt lyrics, create a musical experience that feels like a warm embrace. Folk music, with its roots in storytelling and traditions, often carries a sense of nostalgia and connection to our cultural heritage. It's music that can transport you to different times and places, evoking a deep sense of emotion and reflection. How about you? Do you have any favorite genres or styles of music?",
            "speaker": "Emi",
            "date_time": "17.01.2024, 17:28:03",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:16"
        },
        {
            "clean_text": "Folk and acoustic music can be so soulful! I appreciate a wide range of music genres, but I have a soft spot for classical and jazz. There's something about the intricate melodies and harmonies in classical music, and the improvisation in jazz that I find captivating. Music has a way of touching the heart, doesn't it?",
            "speaker": "Paola",
            "date_time": "17.01.2024, 17:31:01",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:17"
        },
        {
            "clean_text": "Music has a unique power to evoke emotions and connect with our innermost feelings. Classical and jazz music are both rich in complexity and beauty. It's wonderful that you appreciate such diverse genres. If you ever decide to play the piano again, you'll have a wide range of music to explore and enjoy.",
            "speaker": "Emi",
            "date_time": "17.01.2024, 17:31:38",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:18"
        },
        {
            "clean_text": "I'm looking forward to rediscovering the joy of playing the piano and exploring different genres. It's been lovely chatting with you today. If you ever want to share some guitar tips or just chat about music, feel free to reach out. Have a wonderful evening and enjoy your dinner and guitar practice!",
            "speaker": "Paola",
            "date_time": "17.01.2024, 17:32:38",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:19"
        },
        {
            "clean_text": "Thank you, Liza! It's been a pleasure chatting with you too. I'll definitely keep that in mind, and I hope you have a fantastic evening as well. Take care, and let's chat again soon!",
            "speaker": "Emi",
            "date_time": "17.01.2024, 17:34:15",
            "img_file": [],
            "img_url": [],
            "dia_id": "D9:20"
        }
    ],
    "events_session_11": {
        "agent_a": [
            {
                "sub-event": "Emi plans to make a special dinner.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi plans to practice the guitar.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola had a surprise quiz in math class.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola plans to start playing the piano again.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_12": [
        {
            "clean_text": "Hey Liza! How are you today? Did you decide to start playing the piano again, like we talked about yesterday?",
            "speaker": "Emi",
            "date_time": "19.01.2024, 00:08:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:1"
        },
        {
            "clean_text": "Hey! I'm doing well, thanks for asking. I did decide to start playing the piano again. Your encouragement yesterday really motivated me, and I realized how much I missed it. I've already started practicing, and it feels great to reconnect with my musical passion. How about you? Anything exciting happening on your end?",
            "speaker": "Paola",
            "date_time": "19.01.2024, 00:13:10",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:2"
        },
        {
            "clean_text": "That's fantastic to hear that you've taken the leap to start playing the piano again! Music can be such a fulfilling and rewarding hobby. I'm glad I could provide some motivation for you.",
            "speaker": "Emi",
            "date_time": "19.01.2024, 00:16:11",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:3"
        },
        {
            "clean_text": "As for me, not much excitement here, but I did make a little change – I cut my hair! It feels so refreshing and different.",
            "speaker": "Emi",
            "date_time": "19.01.2024, 00:16:14",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:4"
        },
        {
            "clean_text": "I'm curious about your recent hair cut. What inspired you to make this change? Did you go for a significant haircut or just a trim? How are you feeling about the new look?",
            "speaker": "Paola",
            "date_time": "19.01.2024, 00:18:25",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:5"
        },
        {
            "clean_text": "Certainly! I decided to make the change because I was looking for a fresh start and a new look. I went for a significant haircut, opting for a shorter style compared to what I've had in the past. While it's taking some time to adjust to this change, I must say it feels quite refreshing and lighter. Have you ever considered making a major change to your hair, or do you have any favorite hairstyles you've tried in the past?",
            "speaker": "Emi",
            "date_time": "19.01.2024, 00:19:53",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:6"
        },
        {
            "clean_text": "That sounds like a wonderful reason to get a significant haircut. It can be so liberating to embrace a new look. I've experimented with different hairstyles over the years, from short pixie cuts to long, flowing locks. It's always fun to change things up and see how a different hairstyle can make you feel.",
            "speaker": "Paola",
            "date_time": "19.01.2024, 00:24:12",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:7"
        },
        {
            "clean_text": "Currently, I have a medium-length haircut with layers, which I find quite convenient for my daily routine. But who knows, maybe I'll be inspired to try something different in the future. It's all about finding what makes you feel confident and comfortable, right?",
            "speaker": "Paola",
            "date_time": "19.01.2024, 00:24:14",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:8"
        },
        {
            "clean_text": "Absolutely Liza! Experimenting with different hairstyles can be a fun and empowering way to express yourself and feel refreshed. Your medium-length haircut with layers sounds like a versatile and practical choice for daily life. And you're absolutely right; it's all about finding a style that boosts your confidence and makes you feel comfortable.",
            "speaker": "Emi",
            "date_time": "19.01.2024, 00:25:32",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:9"
        },
        {
            "clean_text": "If you ever decide to try something different in the future, whether it's a bold change or a subtle tweak, I'm sure it will suit you perfectly. It's all about embracing your personal style and enjoying the journey of self-expression.",
            "speaker": "Emi",
            "date_time": "19.01.2024, 00:25:44",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:10"
        },
        {
            "clean_text": "Is there any particular hairstyle or look you've always wanted to try but haven't had the chance to yet?",
            "speaker": "Emi",
            "date_time": "19.01.2024, 00:25:46",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:11"
        },
        {
            "clean_text": "Thank you, Bella! I appreciate your kind words. As for a hairstyle I've always wanted to try but haven't had the chance to yet, I've been curious about trying a vibrant color like pastel pink or lavender highlights. It's a bit out of my comfort zone, but I've seen it look amazing on others, and it seems like a fun way to add a pop of creativity to my look. Of course, I'd want to make sure it's something I feel confident in before taking the plunge. Have you ever experimented with different hair colors or unique styles in the past?",
            "speaker": "Paola",
            "date_time": "19.01.2024, 00:27:02",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:12"
        },
        {
            "clean_text": "You're welcome, Liza! Exploring vibrant hair colors like pastel pink or lavender highlights can be a fantastic way to add a unique and creative touch to your appearance. It's always exciting to step out of your comfort zone and experiment with new looks. It's wise to ensure you feel confident in your choice before making the change because feeling good about your appearance is key.",
            "speaker": "Emi",
            "date_time": "19.01.2024, 00:29:36",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:13"
        },
        {
            "clean_text": "As for me, I've experimented with different hair colors in the past. I've tried highlights and lowlights in various shades, from caramel to burgundy, to add some dimension to my hair. It's been a fun way to switch things up without making a drastic change. Hair can be a canvas for self-expression, and it's great to have options to play with. If you ever decide to go for those pastel pink or lavender highlights, I'm sure they'll look fantastic on you!",
            "speaker": "Emi",
            "date_time": "19.01.2024, 00:30:21",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:14"
        },
        {
            "clean_text": "It's reassuring to hear your positive thoughts about experimenting with hair colors. Hair truly can be a canvas for self-expression, and it's wonderful to have the freedom to switch things up from time to time. Your experiences with highlights and lowlights in various shades sound like a great way to add dimension and creativity to your look while still maintaining some versatility.",
            "speaker": "Paola",
            "date_time": "19.01.2024, 00:32:19",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:15"
        },
        {
            "clean_text": "I'll definitely keep the idea of pastel pink or lavender highlights in mind for the future. It's always inspiring to have supportive friends like you who encourage trying new things. If you ever decide to embark on any new hair adventures, I'd love to hear about them!",
            "speaker": "Paola",
            "date_time": "19.01.2024, 00:32:26",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:16"
        },
        {
            "clean_text": "Will do Liza! Speak soon!",
            "speaker": "Emi",
            "date_time": "19.01.2024, 00:32:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:17"
        }
    ],
    "events_session_12": {
        "agent_a": [
            {
                "sub-event": "Emi cut her hair.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola starts playing the piano.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_13": [
        {
            "clean_text": "Hey Liza, how are you today?",
            "speaker": "Emi",
            "date_time": "20.01.2024, 03:04:16",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:18"
        },
        {
            "clean_text": "Hello Bella! I am fine, what about you? What have you been up to?",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:05:35",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:19"
        },
        {
            "clean_text": "Today, I attended my first Pilates class, which was both challenging and rewarding. It focused on core strength, flexibility, and body awareness. The instructor taught us proper techniques using various equipment, like the reformer. Emphasizing controlled movements and breathing, the class was surprisingly intense yet calming. I left feeling sore but enlightened about my physical fitness, eager to continue and improve in future sessions. What new activities have you sports lately?",
            "speaker": "Emi",
            "date_time": "20.01.2024, 03:07:44",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:20"
        },
        {
            "clean_text": "That sounds like a fantastic experience with your Pilates class! It's great to hear how it combined intensity with a sense of calmness.",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:09:56",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:21"
        },
        {
            "clean_text": "As for me, I've recently taken up kickboxing. It's an exhilarating sport that blends martial arts techniques with heart-pumping cardio.",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:10:15",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:22"
        },
        {
            "clean_text": "Kickboxing is not just about physical strength; it also sharpens reflexes and improves coordination. The workouts are dynamic, involving punches, kicks, and defensive moves, which makes every session exciting. It's quite a workout but so rewarding, both mentally and physically.",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:10:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:23"
        },
        {
            "clean_text": "Like Pilates, kickboxing also places importance on technique and body awareness but in a more high-energy setting. It's a fantastic way to release stress and build endurance. How do you prepare for your pilates class?",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:10:33",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:24"
        },
        {
            "clean_text": "Kickboxing sounds amazing, Liza! It must be a great way to stay fit and energized.",
            "speaker": "Emi",
            "date_time": "20.01.2024, 03:11:46",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:25"
        },
        {
            "clean_text": "Preparing for Pilates, I focus on both mental and physical readiness. I usually have a light, healthy snack beforehand for energy and ensure I'm well-hydrated. Stretching is key, so I do a few basic stretches to warm up my muscles. Mentally, I try to clear my mind and focus on being present in the class, which helps with the mindfulness aspect of Pilates. Comfortable, flexible clothing is essential too, to allow for a full range of motion. Lastly, I always bring a water bottle and a towel to the class.",
            "speaker": "Emi",
            "date_time": "20.01.2024, 03:12:38",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:26"
        },
        {
            "clean_text": "What about you? How do you prepare for your kickboxing sessions?",
            "speaker": "Emi",
            "date_time": "20.01.2024, 03:12:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:27"
        },
        {
            "clean_text": "Your preparation routine for Pilates sounds really thorough and mindful, Bella. For kickboxing, my preparation is quite similar in some ways. I make sure to eat a balanced meal a couple of hours before training to fuel my body. Hydration is crucial, so I drink plenty of water throughout the day. I also do dynamic stretching to warm up my muscles and joints, which is important to avoid injuries during the high-intensity movements of kickboxing.",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:14:49",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:28"
        },
        {
            "clean_text": "Mentally, I try to enter each session with a positive and determined mindset. Kickboxing can be quite challenging, so staying focused and motivated is key.",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:15:04",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:29"
        },
        {
            "clean_text": "I wear comfortable, breathable athletic wear and always have my gloves and protective gear ready. I find listening to some upbeat music before the session really helps to get me in the right headspace.",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:15:13",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:30"
        },
        {
            "clean_text": "After each session, cooling down and stretching are essential to help my muscles recover. I also reflect on the session to recognize my progress and areas for improvement. It's a holistic approach, balancing the physical exertion with mental preparation and post-exercise care. Do you have any post-class routines for Pilates, Bella?",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:15:48",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:31"
        },
        {
            "clean_text": "I really admire your dedication and holistic approach to kickboxing, Liza! Post pilates, my routine is quite similar to yours in terms of recovery and reflection. After class, I focus on cooling down with some gentle stretching to help my muscles relax. This also helps in reducing any soreness the next day.",
            "speaker": "Emi",
            "date_time": "20.01.2024, 03:16:19",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:32"
        },
        {
            "clean_text": "Hydration post-class is just as important as pre-class, so I make sure to drink plenty of water. I usually have a small snack like a piece of fruit or a protein bar to replenish my energy levels. Mindfulness doesn’t stop with the class; I take a few minutes to meditate and reflect on the session, acknowledging my efforts and the progress I've made.",
            "speaker": "Emi",
            "date_time": "20.01.2024, 03:17:07",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:33"
        },
        {
            "clean_text": "I also keep a journal where I note down my experiences from each class, what I found challenging, and any improvements I observe. It's a great way to track progress and stay motivated. Like you, I find that focusing on both the mental and physical aspects of recovery is key to a well-rounded fitness routine. Have you noticed any specific benefits from kickboxing that have surprised you?",
            "speaker": "Emi",
            "date_time": "20.01.2024, 03:18:03",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:34"
        },
        {
            "clean_text": "That's a great idea to keep a journal, Bella! It must be so rewarding to see your progress over time. Kickboxing has brought many surprising benefits.",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:20:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:35"
        },
        {
            "clean_text": "Beyond the physical fitness, I've noticed an increase in my mental resilience and stress management. It's also boosted my confidence and helped me feel more empowered. The sense of community in the class is fantastic too – it's supportive and encouraging.",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:20:11",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:36"
        },
        {
            "clean_text": "Both Pilates and kickboxing seem to offer more than just physical benefits; they're great for our overall well-being. I'm glad we both found activities that we enjoy and that contribute positively to our lives. It's been really nice talking today and sharing our fitness journeys. Let's keep each other updated on our progress!",
            "speaker": "Paola",
            "date_time": "20.01.2024, 03:21:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:37"
        },
        {
            "clean_text": "Absolutely, Liza! The mental and community aspects are truly invaluable. I agree, it's been wonderful exchanging our experiences and insights. Let's definitely keep in touch about our fitness adventures. Wishing you the best in your kickboxing journey, and looking forward to our next catch-up. Take care!",
            "speaker": "Emi",
            "date_time": "20.01.2024, 03:22:01",
            "img_file": [],
            "img_url": [],
            "dia_id": "D10:38"
        }
    ],
    "events_session_13": {
        "agent_a": [
            {
                "sub-event": "Emi attended her first Pilates class.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola takes up kickboxing.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_14": [
        {
            "clean_text": "Hi Bella? How are you today? What have you been up to?",
            "speaker": "Paola",
            "date_time": "21.01.2024, 00:04:50",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:1"
        },
        {
            "clean_text": "Hey Liza! I'm good thank you for asking! Today I started re-watching one of my favorite sitcoms \"Friends\". What have you been up to?",
            "speaker": "Emi",
            "date_time": "21.01.2024, 00:07:10",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:2"
        },
        {
            "clean_text": "Oh, \"Friends\" is such a classic! I love that show too. It always makes me laugh. As for me, I've been trying out a new recipe for homemade pizza. It's a bit of a challenge, but I'm hoping it turns out delicious! What's your favorite episode of \"Friends\"?",
            "speaker": "Paola",
            "date_time": "21.01.2024, 00:12:04",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:3"
        },
        {
            "clean_text": "That sounds amazing, Liza! There's something special about homemade pizza, isn't there? I'd love to hear how it turns out.",
            "speaker": "Emi",
            "date_time": "21.01.2024, 00:13:05",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:4"
        },
        {
            "clean_text": "As for \"Friends\", it's tough to pick just one favorite episode! But if I had to choose, it might be \"The One with the Embryos.\" It's the episode where they have the trivia game about each other and end up switching apartments. The humor is just spot on, and it showcases the chemistry between the characters so well. Plus, it's always fun to see how well you remember the details from your favorite shows. How about you? Do you have a favorite episode or a memorable scene that always cracks you up?",
            "speaker": "Emi",
            "date_time": "21.01.2024, 00:14:03",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:5"
        },
        {
            "clean_text": "Homemade pizza does have its own charm. I'll definitely let you know how mine turns out. And yes, \"The One with the Embryos\" is hilarious! For me, \"The One Where Everybody Finds Out\" about Monica and Chandler always gets me laughing. The scene where Phoebe and Chandler are pretending to seduce each other is just comedy gold. The way the entire situation escalates and the reactions of the rest of the group are priceless. It's those moments of unexpected humor and the cast's incredible timing that make \"Friends\" timeless for me. What other sitcoms do you enjoy watching?",
            "speaker": "Paola",
            "date_time": "21.01.2024, 00:16:06",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:6"
        },
        {
            "clean_text": "Oh, \"The One Where Everybody Finds Out\" is a classic indeed! The dynamic between Phoebe and Chandler in that episode is unforgettable. About other sitcoms, I really enjoy \"The Office\" – its unique style of humor and the mockumentary format make it stand out. Then there's \"Brooklyn Nine-Nine\" for its brilliant mix of comedy and heartwarming moments. And I can't forget \"Parks and Recreation\"  the characters are so well-developed and hilarious. Each of these shows has its own flavor of humor and memorable characters, just like \"Friends\". What about you, Liza? Any other sitcoms or shows that you find yourself returning to for a good laugh?",
            "speaker": "Emi",
            "date_time": "21.01.2024, 00:18:12",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:7"
        },
        {
            "clean_text": "I totally agree with you on \"The Office\" and \"Brooklyn Nine-Nine\"; they're both fantastic! I love the quirkiness of \"The Office\" characters, especially Dwight. And \"Brooklyn Nine-Nine\" just nails the balance between comedy and touching moments.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 00:20:59",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:8"
        },
        {
            "clean_text": "I'm also a big fan of \"Schitt's Creek\" - the character development throughout the series is amazing, and it's filled with heart and humor.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 00:21:12",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:9"
        },
        {
            "clean_text": "Another one I love is \"The Good Place\" for its unique concept and witty writing. It's great how each of these shows brings something different to the table, making the world of sitcoms so diverse and enjoyable. Do you watch any non-comedy series as well?",
            "speaker": "Paola",
            "date_time": "21.01.2024, 00:21:15",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:10"
        },
        {
            "clean_text": "\"Schitt's Creek\" and \"The Good Place\" are both brilliant choices! \"Schitt's Creek\" has such a charming and warm vibe, and \"The Good Place\" really is a masterclass in creative storytelling.",
            "speaker": "Emi",
            "date_time": "21.01.2024, 00:22:27",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:11"
        },
        {
            "clean_text": "As for non-comedy series, I do have a few favorites. I'm quite into mystery and drama, so \"Sherlock\" is at the top of my list with its clever plots and amazing character dynamics. I also enjoy \"Stranger Things\" for its blend of sci-fi, nostalgia, and suspense. And for something a bit different, I love \"The Crown\" for its historical insights and stunning performances.",
            "speaker": "Emi",
            "date_time": "21.01.2024, 00:23:19",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:12"
        },
        {
            "clean_text": "What about you? Any favorite genres or series outside of comedy?",
            "speaker": "Emi",
            "date_time": "21.01.2024, 00:23:22",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:13"
        },
        {
            "clean_text": "\"Sherlock\" and \"Stranger Things\" are definitely on my list of favorites too! The suspense and storytelling in both are just top-notch.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 00:24:39",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:14"
        },
        {
            "clean_text": "I'm also a fan of historical dramas, so \"The Crown\" sounds intriguing – I'll have to give it a watch. Besides those, I really like fantasy series like \"Game of Thrones\" for its complex characters and epic storylines.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 00:24:52",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:15"
        },
        {
            "clean_text": "It's been great chatting about our favorite shows, Bella! I'll have to check out some of your recommendations. I should get back to my pizza now before it burns! Let's catch up again soon, and enjoy the rest of your \"Friends\" marathon!",
            "speaker": "Paola",
            "date_time": "21.01.2024, 00:25:15",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:16"
        },
        {
            "clean_text": "Absolutely, \"Game of Thrones\" is a classic in its own right! Thanks for the wonderful conversation, Liza. It's always a pleasure to share and discover new shows. Good luck with your pizza – I'm sure it will be delicious! Definitely, let's plan to catch up again soon. Enjoy your evening and the pizza-making adventure! Take care and talk to you later!",
            "speaker": "Emi",
            "date_time": "21.01.2024, 00:33:17",
            "img_file": [],
            "img_url": [],
            "dia_id": "D11:17"
        }
    ],
    "events_session_14": {
        "agent_a": [
            {
                "sub-event": "Emi re-watches her favorite sitcom \"Friends\".",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola tries a new recipe for homemade pizza.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_15": [
        {
            "clean_text": "Hey Liza! How are you? What have you been up to today?",
            "speaker": "Emi",
            "date_time": "21.01.2024, 20:50:39",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:1"
        },
        {
            "clean_text": "How did the homemade pizza come out?",
            "speaker": "Emi",
            "date_time": "21.01.2024, 20:50:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:2"
        },
        {
            "clean_text": "I'm doing well, thanks for asking. Today's been pretty laid back, just some reading and a bit of gardening. As for the pizza, it turned out great! The crust was just the right amount of crispy, and I got creative with the toppings.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 20:53:47",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:3"
        },
        {
            "clean_text": "Your conversation yesterday inspired me to add some unusual toppings - ended up with a mix of classic pepperoni and some experimental artichoke and feta. It was a hit! How about you? How's your day been? Did you finish your \"Friends\" marathon?",
            "speaker": "Paola",
            "date_time": "21.01.2024, 20:53:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:4"
        },
        {
            "clean_text": "I'm really glad to hear the pizza was a success. Artichoke and feta sound like a delicious combination. My day's been good too. I haven't finished the \"Friends\" marathon yet, but I'm getting there. It's been a mix of relaxing and doing some work around the house. Your gardening mention has inspired me, I think I might spend some time tomorrow working on my little herb garden. It's always so rewarding. Do you have any garderning tips?",
            "speaker": "Emi",
            "date_time": "21.01.2024, 20:58:34",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:5"
        },
        {
            "clean_text": "It's great to hear you're enjoying your day, Bella! As for gardening tips, absolutely! One key thing I've learned is to pay attention to the amount of sunlight each plant needs. It really makes a difference.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 21:00:25",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:6"
        },
        {
            "clean_text": "Also, don't underestimate the importance of good soil – it's the foundation for healthy plants. For your herb garden, regular pruning helps promote growth, and be sure not to overwater. Are there any particular herbs or plants you're planning to grow in your garden?",
            "speaker": "Paola",
            "date_time": "21.01.2024, 21:00:36",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:7"
        },
        {
            "clean_text": "Thanks for the tips, Liza! They're really helpful. I'm focusing on some basic herbs like basil, cilantro, and mint since they're versatile for cooking. I'm also trying my hand at lavender for its lovely scent and potential use in homemade teas. Good soil and proper sunlight are definitely on my checklist now. I'm curious, do you have any favorite plants or herbs you've had particular success with in your garden?",
            "speaker": "Emi",
            "date_time": "21.01.2024, 21:02:52",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:8"
        },
        {
            "clean_text": "Lavender is such a lovely choice – not only for its scent but also for its ability to attract bees to the garden. In my garden, I've had great success with rosemary; it's quite resilient and grows well throughout the year.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 21:04:40",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:9"
        },
        {
            "clean_text": "I also enjoy growing cherry tomatoes – they're surprisingly easy and rewarding, plus there's nothing like fresh tomatoes from the garden. If you ever want to expand beyond herbs, cherry tomatoes could be a great start! How's your experience been with cilantro? I know it can be a bit tricky sometimes.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 21:04:43",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:10"
        },
        {
            "clean_text": "Rosemary and cherry tomatoes sound like a delightful combination, Liza! I'll definitely consider adding cherry tomatoes to my garden. They do sound rewarding. As for cilantro, it's been a bit of a learning curve. It grows fast but also bolts quickly in warmer weather, so I've been trying to harvest it regularly.",
            "speaker": "Emi",
            "date_time": "21.01.2024, 21:05:32",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:11"
        },
        {
            "clean_text": "Your mention of bees reminds me – have you tried planting any bee-friendly flowers or plants? I've been thinking about adding some to help support the bee population and add some color to the garden. Any suggestions on that front would be wonderful!",
            "speaker": "Emi",
            "date_time": "21.01.2024, 21:05:35",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:12"
        },
        {
            "clean_text": "Managing cilantro can indeed be a bit tricky, but it sounds like you're on the right track with regular harvesting.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 21:06:48",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:13"
        },
        {
            "clean_text": "For bee-friendly plants, I've had great success with lavender, which you're already planning, and also with borage and echinacea. They're not only beautiful but also attract a lot of bees and butterflies.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 21:07:07",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:14"
        },
        {
            "clean_text": "Sunflowers are another favorite of mine, both for their beauty and their appeal to bees. Plus, they can add a dramatic touch to any garden. Maybe you can try one or two of these and see how it goes.",
            "speaker": "Paola",
            "date_time": "21.01.2024, 21:07:18",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:15"
        },
        {
            "clean_text": "This is a portion of my gardening, inside my house",
            "speaker": "Emi",
            "date_time": "21.01.2024, 21:08:56",
            "img_file": [
                "00000471-PHOTO-2024-01-21-21-08-29.jpg",
                "00000471-PHOTO-2024-01-21-21-08-29_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D12:17",
            "blip_caption": "there are many potted plants on the windowsill of this restaurant"
        },
        {
            "clean_text": "Borage, echinacea, and sunflowers are wonderful suggestions! I love the idea of adding a splash of color while supporting the local bee population. I think sunflowers would be a stunning addition – their height and vibrancy are always so striking. I'll definitely give these a try and let you know how it goes.",
            "speaker": "Emi",
            "date_time": "21.01.2024, 21:09:18",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:18"
        },
        {
            "clean_text": "Your gardening skills are great. Taking care of plants can be so rewarding, and having greenery indoors adds a nice touch to the ambiance. Thanks a lot for sharing them with me. Talk again tomorrow Bella!",
            "speaker": "Paola",
            "date_time": "21.01.2024, 21:17:30",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:19"
        }
    ],
    "events_session_15": {
        "agent_a": [
            {
                "sub-event": "Emi plans to work on her little herb garden.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola is gardening.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_16": [
        {
            "clean_text": "Hey Liza, what are you up to today?",
            "speaker": "Emi",
            "date_time": "22.01.2024, 21:49:36",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:20"
        },
        {
            "clean_text": "It's been a pretty chill day. I've been busy planning a trip with my boyfriend. We're thinking of going somewhere romantic for our 3 year anniversary! How about you? What's your day been like?",
            "speaker": "Paola",
            "date_time": "22.01.2024, 22:04:20",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:21"
        },
        {
            "clean_text": "That sounds so exciting, Liza! Planning a romantic getaway for your anniversary is such a special way to celebrate. Do you have any specific destinations in mind? As for my day, it's been quite relaxed. I spent some time in the garden and am now doing a bit of reading. It's nice to have these quiet moments.",
            "speaker": "Emi",
            "date_time": "22.01.2024, 22:05:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:22"
        },
        {
            "clean_text": "We're actually considering either Paris or Verona, both are so romantic and have always been on our wish list. Your day sounds lovely, Bella. Gardening and reading are such peaceful activities. Speaking of which, what book are you currently enjoying?",
            "speaker": "Paola",
            "date_time": "22.01.2024, 22:07:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:23"
        },
        {
            "clean_text": "Paris or Verona, both sound absolutely dreamy for an anniversary trip! Imagine the beautiful streets of Paris, the art, the cafes, and of course, the iconic Eiffel Tower. And Verona, with its romantic history, especially being the setting for Shakespeare's Romeo and Juliet, must be magical. As for the book, I'm reading \"Where the Crawdads Sing\" by Delia Owens. It's a captivating mix of mystery and coming-of-age story, set against a beautiful natural backdrop. The narrative is so engaging and beautifully written.",
            "speaker": "Emi",
            "date_time": "22.01.2024, 22:08:40",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:24"
        },
        {
            "clean_text": "Your take on Paris and Verona truly heightens my anticipation! I'm slightly more inclined towards Verona, captivated by its enchanting history and quaint streets. Your book choice, \"Where the Crawdads Sing,\" sounds utterly absorbing. I've been delving into \"A Gentleman in Moscow\" by Amor Towles recently, which is a delightful blend of historical richness and character depth.",
            "speaker": "Paola",
            "date_time": "22.01.2024, 22:14:44",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:25"
        },
        {
            "clean_text": "Have you been to any romantic destinations that left a lasting impression on you? I'm always on the lookout for travel inspiration.",
            "speaker": "Paola",
            "date_time": "22.01.2024, 22:14:54",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:26"
        },
        {
            "clean_text": "\"A Gentleman in Moscow\" is a fantastic choice, Liza! The way Towles paints the picture of historical Russia through such a captivating narrative is just brilliant.",
            "speaker": "Emi",
            "date_time": "22.01.2024, 22:17:03",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:27"
        },
        {
            "clean_text": "As for romantic destinations, I once visited Santorini in Greece, and it was breathtaking. The sunsets over the caldera are like a painting come to life, and the charming little streets with their whitewashed buildings are so picturesque. It's a place that truly feels like stepping into a romantic dream. Have you considered any Greek islands for your trip? They offer a blend of stunning scenery, history, and, of course, delicious cuisine!",
            "speaker": "Emi",
            "date_time": "22.01.2024, 22:17:08",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:28"
        },
        {
            "clean_text": "I've always been drawn to the beauty of the Greek islands. A few years ago, I visited Crete and was mesmerized by its mix of stunning beaches and rich history. The food was a highlight – fresh seafood, delicious cheeses, and the famous Greek salad.",
            "speaker": "Paola",
            "date_time": "22.01.2024, 22:20:06",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:29"
        },
        {
            "clean_text": "Hearing about your experience in Santorini makes me eager to explore more of Greece. Did you have any memorable meals or dishes in Santorini? Experiencing local cuisine is always a highlight for me when traveling",
            "speaker": "Paola",
            "date_time": "22.01.2024, 22:20:08",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:30"
        },
        {
            "clean_text": "Greek islands indeed have a unique charm. In Santorini, the food was exceptional. I particularly loved trying the local specialty, Santorinian fava, a delicious yellow split pea puree. The fresh seafood there was also incredible, especially the grilled octopus. Dining al fresco with the view of the Aegean Sea was an experience in itself. If you're leaning towards Greece, each island has its own distinct flavor and character, which makes exploring them so special. Do you have any specific activities or experiences in mind for your anniversary trip?",
            "speaker": "Emi",
            "date_time": "22.01.2024, 22:22:06",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:31"
        },
        {
            "clean_text": "This was my favorite plate in Greece. I really like shrimps. Whether grilled, sautéed, or in a tasty seafood dish, shrimps always add a delightful flavor.",
            "speaker": "Paola",
            "date_time": "22.01.2024, 22:24:27",
            "img_file": [
                "00000487-PHOTO-2024-01-22-22-24-16_opt.jpg",
                "00000487-PHOTO-2024-01-22-22-24-16.jpg"
            ],
            "img_url": [],
            "dia_id": "D12:33",
            "blip_caption": "there are shrimp on a plate with a sauce on it"
        },
        {
            "clean_text": "For our anniversary trip, besides exploring local cuisines, we're thinking of including some cultural experiences like visiting historical sites or local art galleries. We both love immersing ourselves in the culture and history of the places we visit.",
            "speaker": "Paola",
            "date_time": "22.01.2024, 22:24:49",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:34"
        },
        {
            "clean_text": "A cooking class, especially in a place like Greece, could also be a fun and memorable experience. The more we talk about it, the more excited I get about planning this trip! Thanks for sharing your experiences and ideas; they're truly inspiring!",
            "speaker": "Paola",
            "date_time": "22.01.2024, 22:24:53",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:35"
        },
        {
            "clean_text": "Cultural experiences and a cooking class sound like fantastic additions to your anniversary trip, Liza! It's a great way to connect more deeply with the place and create lasting memories. I'm sure whatever you plan will be wonderful and full of special moments.",
            "speaker": "Emi",
            "date_time": "22.01.2024, 22:26:35",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:36"
        },
        {
            "clean_text": "It's been lovely discussing travel and food with you! I can't wait to hear all about your trip once you're back. Have a great evening, and let's catch up again soon!",
            "speaker": "Emi",
            "date_time": "22.01.2024, 22:26:56",
            "img_file": [],
            "img_url": [],
            "dia_id": "D12:37"
        }
    ],
    "events_session_16": {
        "agent_a": [
            {
                "sub-event": "Emi reads \"Where the Crawdads Sing\" by Delia Owens.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola plans a trip with her boyfriend.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_17": [
        {
            "clean_text": "Hey Liza! How are you today? Did you decide on where you're going for your anniversary trip, like we talked about yesterday?",
            "speaker": "Emi",
            "date_time": "23.01.2024, 18:50:47",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:1"
        },
        {
            "clean_text": "Hey Bella! I'm doing well, thanks for asking. Yes, we did decide on our anniversary trip! After our chat, we got really excited about the idea of visiting a Greek island, and we've chosen Santorini.",
            "speaker": "Paola",
            "date_time": "23.01.2024, 19:00:44",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:2"
        },
        {
            "clean_text": "Your description of it was so vivid and inviting, it just felt like the perfect choice. We're looking forward to the beautiful views, the food, and just soaking in the romantic atmosphere.",
            "speaker": "Paola",
            "date_time": "23.01.2024, 19:00:54",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:3"
        },
        {
            "clean_text": "Thanks so much for your suggestions, they really helped us make up our minds. How's your day going so far?",
            "speaker": "Paola",
            "date_time": "23.01.2024, 19:00:56",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:4"
        },
        {
            "clean_text": "I'm thrilled to hear that you've decided on Santorini for your anniversary trip! It's a breathtakingly beautiful place, and I'm sure you'll have an unforgettable experience there. The views, the food, and the ambiance are all spectacular.",
            "speaker": "Emi",
            "date_time": "23.01.2024, 19:05:17",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:5"
        },
        {
            "clean_text": "My day's been going great, thank you for asking!",
            "speaker": "Emi",
            "date_time": "23.01.2024, 19:05:24",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:6"
        },
        {
            "clean_text": "Speaking of trips, have you considered any beauty treatments or pampering sessions before you go? It's always nice to feel extra special on such an important occasion. I can give you some tips and ideas if you're interested!",
            "speaker": "Emi",
            "date_time": "23.01.2024, 19:05:32",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:7"
        },
        {
            "clean_text": "That's a fantastic idea! We want to make this anniversary trip really special, so some beauty treatments and pampering sessions sound perfect. I'd love to hear your tips and ideas on how we can prepare and feel extra special before our trip. What do you recommend?",
            "speaker": "Paola",
            "date_time": "23.01.2024, 19:07:01",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:8"
        },
        {
            "clean_text": "I'm glad you're interested! Here are some ideas to help you prepare for your trip and feel your best:\nSpa Day: Consider booking a spa day where you can both relax with massages, facials, and other treatments. It's a great way to de-stress and rejuvenate before your trip.\nManicure and Pedicure: Treat yourselves to a manicure and pedicure session. You can even choose colors that match the vibrant atmosphere of Santorini.\nHair Salon: Visit a hair salon for a fresh haircut or style. You can also inquire about beachy waves or a hairstyle that suits the island's vibe.\nSkin Care Routine: Start a skincare routine a few weeks before your trip to ensure your skin looks radiant. Use hydrating masks and moisturizers to keep your skin glowing.\nExercise: Consider some light exercise or yoga sessions to feel physically and mentally prepared for your trip.\nHealthy Eating: Incorporate more fruits and vegetables into your diet to boost your energy levels and overall well-being.\nPacking Essentials: Don't forget to pack essentials like sunscreen, a good hat, and comfortable shoes for exploring the island.",
            "speaker": "Emi",
            "date_time": "23.01.2024, 19:08:42",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:9"
        },
        {
            "clean_text": "What are some things you like to do before a trip?",
            "speaker": "Emi",
            "date_time": "23.01.2024, 19:09:01",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:10"
        },
        {
            "clean_text": "Those are fantastic suggestions, Bella! Thank you for sharing them. Before a trip, I like to do a few things to prepare and get into the vacation mindset such as:\n1. Research: I enjoy researching the destination thoroughly to learn about its culture, history, and top attractions. It helps me get excited about the trip and plan our itinerary.\n2. ⁠Packing List: I create a detailed packing list to make sure we don't forget any essentials. It helps reduce the stress of last-minute packing.\n3. ⁠Travel Insurance: I make sure we have comprehensive travel insurance in case of any unexpected events during the trip.\n4. ⁠Language Basics: If the destination has a different language, I try to learn a few basic phrases to help with communication and show respect for the local culture.\n5. ⁠Camera and Photography Gear: I check that my camera and photography gear are in good working condition, as I love capturing memories during our travels.\n6. ⁠Travel Apps: I download useful travel apps like maps, translation tools, and local guides to my phone for easy access while on the go.\n7. ⁠Money and Finances: I inform my bank about our travel plans to avoid any issues with using credit/debit cards abroad and exchange some local currency in advance.",
            "speaker": "Paola",
            "date_time": "23.01.2024, 19:12:34",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:11"
        },
        {
            "clean_text": "These preparations help ensure a smooth and enjoyable travel experience. Do you have any additional tips or rituals you like to follow before a trip?",
            "speaker": "Paola",
            "date_time": "23.01.2024, 19:13:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:12"
        },
        {
            "clean_text": "Your pre-trip rituals sound quite organized and thoughtful! It's essential to be well-prepared to make the most of your vacation.",
            "speaker": "Emi",
            "date_time": "23.01.2024, 19:29:14",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:13"
        },
        {
            "clean_text": "One additional tip I'd like to share is creating a travel playlist. Music can enhance the travel experience and create lasting memories. Choosing songs that evoke the mood of your destination or that you both enjoy can add an extra layer of enjoyment to your journey.",
            "speaker": "Emi",
            "date_time": "23.01.2024, 19:29:18",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:14"
        },
        {
            "clean_text": "Thank you, Bella! I couldn't agree more about the importance of preparation and creating memorable travel experiences. The idea of a travel playlist is fantastic, and we'll definitely incorporate it into our Santorini trip. Music has a magical way of enhancing the ambiance.",
            "speaker": "Paola",
            "date_time": "23.01.2024, 19:32:21",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:15"
        },
        {
            "clean_text": "Is there a specific song or type of music that reminds you of a memorable travel experience or a dream destination you'd like to visit someday?",
            "speaker": "Paola",
            "date_time": "23.01.2024, 19:32:24",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:16"
        },
        {
            "clean_text": "Oh, absolutely! Certain songs instantly transport me back to specific travel moments. For example, \"Somewhere Over the Rainbow\" by Israel Kamakawiwo'ole reminds me of my trip to Hawaii, and \"Volare\" by Dean Martin brings back memories of a charming Italian village I visited. Music has this incredible ability to connect us to our travel memories. How about you? Any songs that trigger travel memories or inspire your wanderlust?",
            "speaker": "Emi",
            "date_time": "23.01.2024, 19:33:20",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:17"
        },
        {
            "clean_text": "It’s amazing how music can create such strong associations with travel memories. One song that always brings back fond memories is “Hotel California” by The Eagles, which reminds me of a road trip along the California coast.",
            "speaker": "Paola",
            "date_time": "23.01.2024, 19:34:38",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:18"
        },
        {
            "clean_text": "And “Sway” by Dean Martin takes me back to dancing under the stars during a trip to a Mediterranean island. Music truly has a way of making those moments unforgettable.",
            "speaker": "Paola",
            "date_time": "23.01.2024, 19:35:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:19"
        },
        {
            "clean_text": "It was lovely speaking to you today Liza! Speak soon!",
            "speaker": "Emi",
            "date_time": "23.01.2024, 19:35:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:20"
        }
    ],
    "events_session_17": {
        "agent_a": [],
        "agent_b": [
            {
                "sub-event": "Paola decides to visit Santorini on her anniversary trip.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_18": [
        {
            "clean_text": "Hi Bella? How are you today? What have you been doing lately?",
            "speaker": "Paola",
            "date_time": "24.01.2024, 22:26:43",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:21"
        },
        {
            "clean_text": "Hey Liza! I'm actually having quite a hard day today. My boyfriend broke up with me due to long distance. We were having a relationship from Los Angeles to Sydney Australia and we barely saw eachother.",
            "speaker": "Emi",
            "date_time": "24.01.2024, 22:29:20",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:22"
        },
        {
            "clean_text": "Do you have any advice on dealing with break ups? This is my first one and I don't know how to make myself feel better.",
            "speaker": "Emi",
            "date_time": "24.01.2024, 22:29:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:23"
        },
        {
            "clean_text": "I'm sorry to hear that you're going through a tough time, Bella. Breakups can be really difficult, especially when distance is a factor. Here are some tips that might help you cope with the breakup and start feeling better:\n1. Allow yourself to grieve: It's perfectly normal to feel sad, angry, or even numb after a breakup. Give yourself permission to experience these emotions and understand that it's a natural part of the healing process.\n2. ⁠Lean on your support system: Reach out to friends and family who can offer you emotional support and a listening ear. Talking about your feelings can be cathartic and help you process what you're going through.\n3. ⁠Focus on self-care: Take care of your physical and emotional well-being. Make sure to eat healthily, get enough rest, and engage in activities that make you happy and relaxed. Exercise can also be a great way to boost your mood.\n4. ⁠Avoid contact with your ex: While it can be tempting to stay in touch with your ex, especially if you were friends before the relationship, it's usually best to have some space to heal and gain perspective. Consider unfollowing or muting them on social media for a while.\n5. ⁠Set new goals and routines: This is an opportunity to rediscover yourself and your interests. Set new goals, whether they are personal or professional, and create routines that help you stay focused and motivated.\n6. ⁠Seek professional help if needed: If you find that your emotions are overwhelming and affecting your daily life for an extended period, consider speaking to a therapist or counselor who can provide guidance and support.\n7. ⁠Time heals: Remember that healing takes time, and it's okay to have ups and downs. Be patient with yourself and allow yourself to gradually move forward.\n8. ⁠Consider journaling: Writing down your thoughts and feelings in a journal can be a therapeutic way to process your emotions and gain clarity about the situation.",
            "speaker": "Paola",
            "date_time": "24.01.2024, 22:32:56",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:24"
        },
        {
            "clean_text": "Ultimately, everyone's healing process is unique, so it's essential to find what works best for you. Surrounding yourself with positivity, focusing on self-improvement, and seeking support from loved ones can go a long way in helping you recover from a breakup.",
            "speaker": "Paola",
            "date_time": "24.01.2024, 22:33:05",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:25"
        },
        {
            "clean_text": "Thank you so much for your kind and thoughtful message. It really means a lot to me to have your support during this difficult time. Your advice is incredibly valuable, and I'll definitely take it to heart.",
            "speaker": "Emi",
            "date_time": "24.01.2024, 22:34:50",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:26"
        },
        {
            "clean_text": "I've already started to allow myself to grieve and process my emotions, and talking to friends and family has been a great source of comfort. Self-care has been a priority for me as well, and I've been trying to stay active and maintain a healthy routine. I think your suggestion to avoid contact with my ex for a while is wise, even though it's not easy. Creating new goals and routines is something I'm looking forward to as a way to rediscover myself. If things get too overwhelming, I'll definitely consider seeking professional help. It's reassuring to know that there are resources available for additional support.",
            "speaker": "Emi",
            "date_time": "24.01.2024, 22:35:10",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:27"
        },
        {
            "clean_text": "As I navigate through this challenging period, I'm curious to know if you've ever faced a breakup in a long-distance relationship yourself, and if so, how did you cope with it?",
            "speaker": "Emi",
            "date_time": "24.01.2024, 22:36:09",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:28"
        },
        {
            "clean_text": "I haven't personally experienced a breakup in a long-distance relationship, but I've known friends who have gone through similar situations.",
            "speaker": "Paola",
            "date_time": "24.01.2024, 22:37:43",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:29"
        },
        {
            "clean_text": "From their experiences, I've seen that maintaining a strong support system, focusing on personal growth and self-discovery, and giving yourself time to heal are all crucial aspects of coping effectively. What are some things you've tried out now that are helping you deal with the break up?",
            "speaker": "Paola",
            "date_time": "24.01.2024, 22:37:59",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:30"
        },
        {
            "clean_text": "I appreciate your understanding, Liza. It's been reassuring to have the comfort and support of friends and family during this challenging period. There are a few things I've tried to do. Firstly, I've made an effort to acknowledge and accept my feelings rather than bottling them up. Allowing myself to experience sadness, anger, and pain has been a crucial part of my healing process. Also, being surrounded by friends and family has provided a strong support system. Their willingness to lend an ear, offer advice, and distract me when necessary has been immensely comforting. Then I have been taking care of my physical and emotional well-being has been a priority. This includes maintaining a healthy diet, ensuring adequate rest, and staying physically active. Engaging in regular exercise has been particularly effective in elevating my mood and reducing stress. Apart from that, I'm in the process of identifying new personal and professional goals to work towards. This has helped me stay motivated and provided a sense of purpose in my life post-breakup.",
            "speaker": "Emi",
            "date_time": "24.01.2024, 22:41:12",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:31"
        },
        {
            "clean_text": "I've taken the step of unfollowing and muting my ex on social media to establish some emotional space. While it's not without its challenges, I believe it's a necessary part of my healing journey.\nI'm proceeding step by step and practicing patience with myself as I navigate this difficult period. It's reassuring to know that there are a variety of strategies and support systems available to help me through this challenging time.",
            "speaker": "Emi",
            "date_time": "24.01.2024, 22:41:19",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:32"
        },
        {
            "clean_text": "Thank you so much for your support and guidance!",
            "speaker": "Emi",
            "date_time": "24.01.2024, 22:41:39",
            "img_file": [],
            "img_url": [],
            "dia_id": "D13:33"
        }
    ],
    "events_session_18": {
        "agent_a": [
            {
                "sub-event": "Emi's boyfriend broke up with her.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": []
    },
    "session_19": [
        {
            "clean_text": "Hey Bella! How are you feeling today? I can imagine the break up isn't getting any easier.",
            "speaker": "Paola",
            "date_time": "25.01.2024, 17:12:47",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:1"
        },
        {
            "clean_text": "Hi there! Thanks for checking in. To be honest, it's still a bit tough, but I'm taking it one day at a time. Having friends like you who care really makes a difference, and I appreciate your support. How have you been today?",
            "speaker": "Emi",
            "date_time": "25.01.2024, 17:17:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:2"
        },
        {
            "clean_text": "It sounds like you're actively working on your self-care and taking positive steps, Bella. That's fantastic to hear. My day has been pretty good. I had a productive day at work and then spent some time working on a personal project I'm excited about. In the evening, I plan to unwind with a good movie and maybe try out a new recipe myself. Do you have any suggestions on what to watch and eat?",
            "speaker": "Paola",
            "date_time": "25.01.2024, 17:20:33",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:3"
        },
        {
            "clean_text": "When it comes to choosing what to watch, it depends on your preferences. If you're in the mood for a feel-good movie, you might consider a classic like \"The Shawshank Redemption\" or a heartwarming Pixar animation like \"Up.\" If you're into something more light-hearted, a romantic comedy like \"Crazy, Stupid, Love\" or a comedy series like \"Brooklyn Nine-Nine\" could be great options. Of course, if you have a favorite genre or theme in mind, I can provide more tailored recommendations.",
            "speaker": "Emi",
            "date_time": "25.01.2024, 17:26:51",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:4"
        },
        {
            "clean_text": "As for dinner, how about trying out a new pasta dish or a stir-fry? These are often quick and delicious options. If you'd like something on the healthier side, a colorful salad with a variety of veggies and a homemade vinaigrette can be refreshing. If you have any dietary preferences or ingredients you'd like to use, let me know, and I can suggest a recipe that suits your taste.",
            "speaker": "Emi",
            "date_time": "25.01.2024, 17:27:04",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:5"
        },
        {
            "clean_text": "Ultimately, the goal is to create a relaxing and enjoyable evening for yourself, so go with what appeals to you the most!",
            "speaker": "Emi",
            "date_time": "25.01.2024, 17:27:09",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:6"
        },
        {
            "clean_text": "Thank you for the fantastic suggestions, Bella! Those movie choices all sound appealing, and I think I'll go with \"Up\" for a heartwarming and uplifting experience tonight. As for dinner, I'm leaning toward trying a new pasta dish. If you have any specific pasta recipes you'd recommend or if you have a favorite, feel free to share it with me. I'm open to exploring different flavors and cuisines.",
            "speaker": "Paola",
            "date_time": "25.01.2024, 17:30:31",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:7"
        },
        {
            "clean_text": "I appreciate your advice and support; it's helping make my evening plans even better. How about you? Have you decided what you'll be watching or eating tonight?",
            "speaker": "Paola",
            "date_time": "25.01.2024, 17:30:33",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:8"
        },
        {
            "clean_text": "I'm delighted to hear that you're going with \"Up\" for your movie choice! It's a lovely and heartwarming film.",
            "speaker": "Emi",
            "date_time": "25.01.2024, 17:33:19",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:9"
        },
        {
            "clean_text": "As for the pasta dish, how about trying a creamy garlic parmesan pasta with a side of garlic bread? It's a comforting and indulgent option that's relatively easy to make. Here's a picture of a dish similar to what you can expect: To make it, you'll need:\nYour choice of pasta\nButter\nMinced garlic\nHeavy cream\nParmesan cheese\nSalt and pepper\nFresh parsley for garnish",
            "speaker": "Emi",
            "date_time": "25.01.2024, 17:33:53",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:10"
        },
        {
            "clean_text": "As for my evening plans, I'm looking forward to enjoying some homemade vegetable stir-fry and catching up on episodes of a cozy mystery series I've been watching. It should be a relaxing night in.",
            "speaker": "Emi",
            "date_time": "25.01.2024, 17:34:29",
            "img_file": [
                "00000537-PHOTO-2024-01-25-17-35-15.jpg",
                "00000537-PHOTO-2024-01-25-17-35-15_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D14:11",
            "blip_caption": "there is a plate of food with meat, vegetables and spices on it"
        },
        {
            "clean_text": "I have already prepared my ingredients for the stir-fry.",
            "speaker": "Emi",
            "date_time": "25.01.2024, 17:36:11",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:13"
        },
        {
            "clean_text": "That creamy garlic parmesan pasta with garlic bread sounds absolutely delicious, Bella! I'm definitely going to give it a try. That creamy garlic parmesan pasta with garlic bread sounds absolutely delicious, Bella! I'm definitely going to give it a try. Thanks for sharing the ingredients list.",
            "speaker": "Paola",
            "date_time": "25.01.2024, 18:04:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:14"
        },
        {
            "clean_text": "And your plans for the evening with homemade vegetable stir-fry and a cozy mystery series sound perfect for a relaxing night. Here's a picture of a delightful vegetable adn seafood stir-fry with pasta to get you even more excited:",
            "speaker": "Paola",
            "date_time": "25.01.2024, 18:06:23",
            "img_file": [
                "00000541-PHOTO-2024-01-25-18-06-34.jpg",
                "00000541-PHOTO-2024-01-25-18-06-34_opt.jpg"
            ],
            "img_url": [],
            "dia_id": "D14:15",
            "blip_caption": "there is a white bowl filled with pasta and clams"
        },
        {
            "clean_text": "It's great to hear that you've already prepared your ingredients; that's some excellent preparation!",
            "speaker": "Paola",
            "date_time": "25.01.2024, 18:06:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:17"
        },
        {
            "clean_text": "I hope you enjoy your evening, Bella, and that we both have a relaxing and enjoyable time. If you ever want to share more recipes or discuss anything else, feel free to reach out.",
            "speaker": "Paola",
            "date_time": "25.01.2024, 20:46:47",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:18"
        }
    ],
    "events_session_19": {
        "agent_a": [
            {
                "sub-event": "Emi plans to cook a homemade vegetable stir-fry.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi plans to watch episodes of a cozy mystery series.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola worked on a personal project.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola plans to try a new pasta recipe.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola plans to watch a movie.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_20": [
        {
            "clean_text": "Hi, Bella! I hope you had a pleasant evening with your homemade vegetable stir-fry and cozy mystery series. How did it go? Did you enjoy the meal and the show?",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:16:41",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:19"
        },
        {
            "clean_text": "Hey Liza! My evening was quite enjoyable, thank you for asking. The homemade vegetable stir-fry turned out delicious, and it was a satisfying and healthy meal. The cozy mystery series had me hooked, and I ended up watching a few more episodes than planned, it was that engaging! Overall, it was a relaxing and pleasant night.",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:17:28",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:20"
        },
        {
            "clean_text": "How was your evening? Did you enjoy watching \"Up\" and trying out the creamy garlic parmesan pasta?",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:17:38",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:21"
        },
        {
            "clean_text": "I'm delighted to hear that your evening went well, Bella! It sounds like you had a perfect night in.",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:18:45",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:22"
        },
        {
            "clean_text": "My evening was fantastic as well. \"Up\" was as heartwarming as ever, and the creamy garlic parmesan pasta was a hit. I added some roasted cherry tomatoes on top for extra flavor, and it turned out to be a delightful combination. Thanks for the recipe suggestion!",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:19:03",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:23"
        },
        {
            "clean_text": "Do you have any plans for the day ahead? Anything exciting on your agenda?",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:19:18",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:24"
        },
        {
            "clean_text": "And if there's anything specific you'd like to chat about or if you have any questions, feel free to let me know!",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:19:22",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:25"
        },
        {
            "clean_text": "I'm glad to hear that you enjoyed \"Up\" and the pasta, Liza! Roasted cherry tomatoes sound like a wonderful addition.",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:21:04",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:26"
        },
        {
            "clean_text": "As for today, I have a few errands to run and some work to catch up on. Nothing too exciting, but I'm hoping to make the most of the day and maybe do something fun in the evening to unwind. How about you? Any plans or activities you're looking forward to today?",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:21:13",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:27"
        },
        {
            "clean_text": "It sounds like you have a productive day ahead, Bella! Running errands and getting work done can be satisfying in its own way. And it's great that you're planning to unwind in the evening.",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:23:50",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:28"
        },
        {
            "clean_text": "As for me, I have another busy day at work, but I'm also excited about a virtual book club meeting I have later in the evening. We'll be discussing a fascinating novel, so that's something I'm looking forward to. After that, I might continue working on my personal project and maybe try a new dessert recipe.",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:24:03",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:29"
        },
        {
            "clean_text": "Speaking of which, do you have any favorite dessert recipes or treats you enjoy making or indulging in?",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:24:15",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:30"
        },
        {
            "clean_text": "Your day sounds quite packed, Liza! A virtual book club meeting sounds like a wonderful way to unwind and discuss literature with like-minded people.",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:26:00",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:31"
        },
        {
            "clean_text": "As for desserts, I do have a sweet tooth, and I enjoy making and indulging in various treats. One of my favorites to make at home is chocolate lava cake. It's relatively simple to prepare but so indulgent and satisfying when you break into the warm, gooey center. If you're interested, I can share a recipe with you. Do you have any specific desserts you're in the mood for?",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:27:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:32"
        },
        {
            "clean_text": "Chocolate lava cake sounds absolutely delightful, Bella! I would love to have the recipe if you don't mind sharing. It's a treat that never gets old, and there's something so comforting about that gooey, chocolatey center.",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:28:40",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:33"
        },
        {
            "clean_text": "As for my dessert preferences, I enjoy a wide variety of sweets. From classic chocolate chip cookies to fruit tarts, I'm open to trying different desserts. So, feel free to share any dessert recipes you enjoy making or trying out!",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:28:50",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:34"
        },
        {
            "clean_text": "I'm glad you're excited about the chocolate lava cake, Liza! It's a favorite for many, and I'm happy to share the recipe with you.",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:30:18",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:35"
        },
        {
            "clean_text": "Here's a simple recipe for chocolate lava cake:\nIngredients:\n4 oz (115g) semi-sweet chocolate\n1/2 cup (115g) unsalted butter\n1 cup (200g) powdered sugar\n2 large eggs\n2 egg yolks\n1 tsp vanilla extract\n1/4 cup (30g) all-purpose flour\nA pinch of salt\nInstructions:\nPreheat your oven to 425°F. Grease and flour four ramekins or small oven-safe cups.\nIn a microwave-safe bowl, melt the chocolate and butter together in 20-30 second intervals, stirring each time, until smooth and well combined.\nStir in the powdered sugar until it's fully incorporated into the chocolate mixture.\nIn a separate bowl, whisk together the eggs, egg yolks, and vanilla extract until well combined.\nSlowly add the egg mixture into the chocolate mixture, stirring until smooth.\nFinally, fold in the all-purpose flour and a pinch of salt until just combined.\nDivide the batter evenly among the prepared ramekins.\nPlace the ramekins on a baking sheet and bake in the preheated oven for 12-14 minutes, or until the edges are set but the centers are still soft.\nCarefully remove the ramekins from the oven (they'll be hot!) and let them cool for a minute or two.\nRun a knife around the edges to loosen the cakes, then invert them onto serving plates.\nYou can dust them with powdered sugar or top with a scoop of vanilla ice cream for an extra treat. Serve immediately and enjoy the gooey, chocolatey goodness!",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:32:23",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:36"
        },
        {
            "clean_text": "I hope you give it a try, Liza! It's a crowd-pleaser for sure. And if you ever want to explore other dessert recipes, just let me know, I'd be happy to share more!",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:32:57",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:37"
        },
        {
            "clean_text": "Also, if you have any other desserts feel free to share the recipe!",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:35:16",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:38"
        },
        {
            "clean_text": "Thank you so much for sharing the chocolate lava cake recipe, Bella! It sounds delicious, and I can't wait to try it out. I'll definitely let you know how it turns out when I make it.",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:35:59",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:39"
        },
        {
            "clean_text": "My all-time favorite dessert has to be tiramisu, and I'd be thrilled to share the recipe with you. Tiramisu is a classic Italian delicacy that combines layers of coffee-soaked ladyfingers, rich mascarpone cheese, and a dusting of cocoa powder. The result is a heavenly, creamy, and indulgent dessert that's perfect for special occasions or when you're simply craving a sweet treat.\nHere's the recipe:\nIngredients:\n6 large egg yolks\n3/4 cup granulated sugar\n1 cup mascarpone cheese\n1 1/2 cups strong brewed coffee, cooled\n1/4 cup coffee liqueur (optional)\n24-30 ladyfingers\nUnsweetened cocoa powder, for dusting\nDark chocolate shavings (optional)\nInstructions:\nIn a heatproof bowl, whisk together the egg yolks and granulated sugar until the mixture becomes pale and slightly thickened. This step can be done over a double boiler or using a heatproof bowl placed over simmering water.\nRemove the bowl from heat and let it cool for a few minutes. Then, add the mascarpone cheese and mix until smooth and well combined.\nIn a separate shallow dish, combine the cooled brewed coffee and coffee liqueur if using.\nQuickly dip each ladyfinger into the coffee mixture, making sure not to soak them for too long, as they can become too soggy. Arrange a layer of dipped ladyfingers in the bottom of your serving dish.\nSpread half of the mascarpone mixture over the ladyfingers, creating an even layer.\nAdd another layer of dipped ladyfingers on top of the mascarpone layer.\nFinish with the remaining mascarpone mixture, smoothing it out with a spatula.\nCover and refrigerate the tiramisu for at least 4 hours or overnight to allow the flavors to meld and the dessert to set.\nBefore serving, dust the top with unsweetened cocoa powder and garnish with dark chocolate shavings if desired.\nSlice and serve your homemade tiramisu to enjoy this classic Italian delight!\nTiramisu is a dessert that never fails to impress, and it's perfect for sharing with friends and family. I hope you give it a try and savor every delightful bite!",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:37:04",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:40"
        },
        {
            "clean_text": "Wow, tiramisu is absolutely one of my all-time favorite desserts as well! Thank you so much for sharing the recipe. There's just something about that combination of coffee, mascarpone cheese, and ladyfingers that creates such a heavenly dessert. I can almost taste it just reading the instructions.",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:37:47",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:41"
        },
        {
            "clean_text": "I'm definitely going to give this recipe a try soon. It's perfect for indulging in a bit of Italian elegance at home. I'll let you know how it turns out when I make it.",
            "speaker": "Emi",
            "date_time": "27.01.2024, 01:37:48",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:42"
        },
        {
            "clean_text": "Absolutely, Liza! I'm delighted to hear you're excited about trying the tiramisu recipe, and I'll be eagerly awaiting your feedback. If you ever need more dessert recipes, cooking tips, or just want to chat about anything else, feel free to reach out anytime. It's been a pleasure discussing food and other topics with you.",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:39:05",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:43"
        },
        {
            "clean_text": "Wishing you a fantastic day ahead, and I hope your virtual book club meeting and all your future culinary endeavors are delightful and enjoyable. Take care!",
            "speaker": "Paola",
            "date_time": "27.01.2024, 01:39:07",
            "img_file": [],
            "img_url": [],
            "dia_id": "D14:44"
        }
    ],
    "events_session_20": {
        "agent_a": [
            {
                "sub-event": "Emi has a few errands to run and some work to catch up on.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi plans to do something fun in the evening.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Emi plans to cook Tiramisu.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ],
        "agent_b": [
            {
                "sub-event": "Paola has a virtual book club meeting.",
                "date": "",
                "id": "E",
                "caused_by": []
            },
            {
                "sub-event": "Paola plans to try a new dessert recipe.",
                "date": "",
                "id": "E",
                "caused_by": []
            }
        ]
    },
    "session_1_date_time": "06.01.2024, 19:13:14",
    "session_2_date_time": "07.01.2024, 18:59:54",
    "session_3_date_time": "08.01.2024, 22:23:07",
    "session_4_date_time": "10.01.2024, 02:02:23",
    "session_5_date_time": "10.01.2024, 22:48:15",
    "session_6_date_time": "11.01.2024, 22:17:12",
    "session_7_date_time": "13.01.2024, 14:51:05",
    "session_8_date_time": "14.01.2024, 23:36:33",
    "session_9_date_time": "15.01.2024, 22:06:45",
    "session_10_date_time": "17.01.2024, 01:56:23",
    "session_11_date_time": "17.01.2024, 17:05:23",
    "session_12_date_time": "19.01.2024, 00:08:45",
    "session_13_date_time": "20.01.2024, 03:04:16",
    "session_14_date_time": "21.01.2024, 00:04:50",
    "session_15_date_time": "21.01.2024, 20:50:39",
    "session_16_date_time": "22.01.2024, 21:49:36",
    "session_17_date_time": "23.01.2024, 18:50:47",
    "session_18_date_time": "24.01.2024, 22:26:43",
    "session_19_date_time": "25.01.2024, 17:12:47",
    "session_20_date_time": "27.01.2024, 01:16:41",
    "qa": [
        {
            "question": "What tv shows did Paola watch?",
            "answer": "\"The Profector\", \"Friends\", \"The Office\", \"Brooklyn Nine-Nine\", \"Schitt's Creek\", \"The Good Place\", \"Sherlock\", \"Stranger Things\", \"Game of Thrones\".",
            "evidence": [
                "D1:2",
                "D11:6",
                "D11:8",
                "D11:9",
                "D11:10",
                "D11:14",
                "D11:15"
            ],
            "category": 1
        },
        {
            "question": "What tv shows did Emi watch?",
            "answer": "\"Gossip Girl\", \"Friends\", \"The Office\", \"Brooklyn Nine-Nine\", \"Parks and Recreation\", \"Sherlock\", \"Stranger Things\", \"The Crown\", \"The Protector\".",
            "evidence": [
                "D1:3",
                "D11:7",
                "D11:12",
                "D3:10"
            ],
            "category": 1
        },
        {
            "question": "What animals does Emi have?",
            "answer": "A cat Fluffy, a dog Max.",
            "evidence": [
                "D1:5",
                "D7:13"
            ],
            "category": 1
        },
        {
            "question": "How long has Paola lived in New York?",
            "answer": "Since September 2023.",
            "evidence": [
                "D1:19"
            ],
            "category": 2
        },
        {
            "question": "Who has traveled the most?",
            "answer": "Paola visited 6 destinations, while Emi 5 destinations.",
            "evidence": [
                "D1:20",
                "D5:4",
                "D5:22",
                "D5:23",
                "D12:29",
                "D13:19",
                "D5:7",
                "D5:20",
                "D6:11",
                "D13:17"
            ],
            "category": 3
        },
        {
            "question": "In what places did Emi go hiking?",
            "answer": "Trail in Los Angeles, trails in the Sawtooth National Recreation Area.",
            "evidence": [
                "D1:29",
                "D8:17"
            ],
            "category": 1
        },
        {
            "question": "Who is more passionate about hiking?",
            "answer": "Emi hikes and plans to hike a lot of times, while Paola only keeps it in mind for future travel plans.",
            "evidence": [
                "D1:29",
                "D5:11",
                "D8:14",
                "D8:19"
            ],
            "category": 3
        },
        {
            "question": "When Emi had a mini cooking party with a friend?",
            "answer": "On 07.01.2024",
            "evidence": [
                "D2:2"
            ],
            "category": 2
        },
        {
            "question": "When did Paola explore the local art gallery?",
            "answer": "In the morning of 07.01.2024.",
            "evidence": [
                "D2:3"
            ],
            "category": 2
        },
        {
            "question": "What works of art does Paola like?",
            "answer": "Water lily series by Claude Monet, the Sistine Chapel ceiling by Michelangelo.",
            "evidence": [
                "D2:5",
                "D5:23"
            ],
            "category": 1
        },
        {
            "question": "What dishes did Emi prepare?",
            "answer": "Tagine, Greek dishes, Thai coconut curry, stake, stir-fry, chocolate lava cake.",
            "evidence": [
                "D2:7",
                "D3:23",
                "D4:21",
                "D9:9",
                "D14:13",
                "D14:32"
            ],
            "category": 1
        },
        {
            "question": "When did Paola try a dish called Chicken and Waffles?",
            "answer": "Recently before 07.01.2024",
            "evidence": [
                "D2:8"
            ],
            "category": 2
        },
        {
            "question": "What helps Paola when she's tired?",
            "answer": "Going to the bookstore, mom`s dish spanakopita.",
            "evidence": [
                "D2:10",
                "D3:24"
            ],
            "category": 3
        },
        {
            "question": "What are Paola's favorite genres?",
            "answer": "Historical fiction, mystery, fantasy, romance.",
            "evidence": [
                "D2:13",
                "D4:7",
                "D11:15",
                "D3:9"
            ],
            "category": 1
        },
        {
            "question": "What books did Emi read?",
            "answer": "\"The Invisible Life of Addie LaRue\" by V.E. Schwab, \"The Alchemist\" by Paulo Coelho, \"Becoming\" by Michelle Obama, \"Where the Crawdads Sing\" by Delia Owens, \"Me Before You\" by Jojo Moyes, \"The Rosie Project\" by Graeme Simsion.",
            "evidence": [
                "D2:14",
                "D3:33",
                "D3:38",
                "D4:6",
                "D8:6",
                "D8:10"
            ],
            "category": 1
        },
        {
            "question": "When Emi went to the cinema?",
            "answer": "08.01.2024",
            "evidence": [
                "D3:3"
            ],
            "category": 2
        },
        {
            "question": "What movies or tv shows did Paola recommend to Emi?",
            "answer": "\"The Protector\", \"Step Brothers\",  \"The Shawshank Redemption\", \"A beautiful Mind\", \"Gone Girl\".",
            "evidence": [
                "D3:9",
                "D3:13",
                "D7:6",
                "D7:10"
            ],
            "category": 1
        },
        {
            "question": "When Paola made tacos?",
            "answer": "07.01.2024",
            "evidence": [
                "D3:16"
            ],
            "category": 2
        },
        {
            "question": "What dishes did Paola prepare?",
            "answer": "Tacos, rices and vegetables, homemade pizza, creamy garlic parmesan pasta.",
            "evidence": [
                "D3:16",
                "D9:12",
                "D12:3",
                "D14:23"
            ],
            "category": 1
        },
        {
            "question": "What recipes did Paola share?",
            "answer": "Spanakopita, Tiramisu.",
            "evidence": [
                "D3:24",
                "D14:40"
            ],
            "category": 1
        },
        {
            "question": "When Paola's friend recommended \"The Alchemist\"?",
            "answer": "08.01.2024",
            "evidence": [
                "D3:32"
            ],
            "category": 2
        },
        {
            "question": "When does Paola plan to pick up \"The Alchemist\"?",
            "answer": "Weekend after 08.01.2024",
            "evidence": [
                "D3:35"
            ],
            "category": 2
        },
        {
            "question": "Who does Emi meet once a month?",
            "answer": "With a book club.",
            "evidence": [
                "D3:38"
            ],
            "category": 2
        },
        {
            "question": "Does Emi prefer to stand out with her appearance?",
            "answer": "Yes, Emi likes bold nail designs and experiments with different hair color shades.",
            "evidence": [
                "D3:47",
                "D10:14"
            ],
            "category": 3
        },
        {
            "question": "When did Emi have a nail appointment?",
            "answer": "09.01.2024",
            "evidence": [
                "D3:49"
            ],
            "category": 2
        },
        {
            "question": "Which beauty treatments has Emi done?",
            "answer": "Manicure, haircut.",
            "evidence": [
                "D4:3",
                "D10:4"
            ],
            "category": 1
        },
        {
            "question": "Which book did Paola start to read on 09.01.2024?",
            "answer": "\"The Alchemist\".",
            "evidence": [
                "D4:5"
            ],
            "category": 2
        },
        {
            "question": "Where has Paola traveled?",
            "answer": "Italy, Japan, China, Vatican City, Crete, Mediterranean island.",
            "evidence": [
                "D1:20",
                "D5:4",
                "D5:22",
                "D5:23",
                "D12:29",
                "D13:19"
            ],
            "category": 1
        },
        {
            "question": "When did Paola visit Japan?",
            "answer": "A couple of years ago before 2024.",
            "evidence": [
                "D5:4"
            ],
            "category": 2
        },
        {
            "question": "Which destinations are on Emi`s travel bucket list?",
            "answer": "Italy, Japan, Middle-East, Tanzania, Norway, Egypt, Seattle and Portland.",
            "evidence": [
                "D1:28",
                "D5:6",
                "D6:1",
                "D6:5",
                "D6:17",
                "D7:25",
                "D8:27"
            ],
            "category": 1
        },
        {
            "question": "What cuisines does Emi like?",
            "answer": "Greek, Moroccan, Peruvian, Italian.",
            "evidence": [
                "D5:14",
                "D2:4",
                "D7:25"
            ],
            "category": 1
        },
        {
            "question": "What does Paola like to do when traveling?",
            "answer": "Exploring historical sties and art, taking pictures.",
            "evidence": [
                "D5:19",
                "D6:27"
            ],
            "category": 1
        },
        {
            "question": "In which country did Emi see the Mona Lisa?",
            "answer": "Paris is the capital of France.",
            "evidence": [
                "D5:20"
            ],
            "category": 3
        },
        {
            "question": "What cultural activities did Paola engage in?",
            "answer": "Explored the ancient ruins in Rome, visited local art museum, visited the Sistine Chapel.",
            "evidence": [
                "D1:24",
                "D2:3",
                "D5:23"
            ],
            "category": 1
        },
        {
            "question": "Which destinations are on Paola's travel bucket list?",
            "answer": "Greece, Machu Picchu, Petra in Jordan, Amalfi Coast in Italy, safari in Africa, gorilla trekking in Rowanda or Uganda, Northern Pole, Cambodia, Japan, Paris, Verona.",
            "evidence": [
                "D5:9",
                "D5:12",
                "D5:26",
                "D5:16",
                "D6:3",
                "D6:7",
                "D6:19",
                "D6:20",
                "D7:22",
                "D12:23"
            ],
            "category": 1
        },
        {
            "question": "Where has Emi traveled?",
            "answer": "Greece, Paris, Costa Rica, Hawaii, Italy.",
            "evidence": [
                "D5:7",
                "D5:20",
                "D6:11",
                "D13:17"
            ],
            "category": 1
        },
        {
            "question": "What places in America did Paola travel to?",
            "answer": "The Grand Canyon, Pacific Northwest.",
            "evidence": [
                "D6:13",
                "D8:28"
            ],
            "category": 1
        },
        {
            "question": "What are Paola's hobbies?",
            "answer": "Photography, playing the piano, kickboxing, reading.",
            "evidence": [
                "D6:27",
                "D10:2",
                "D10:22",
                "D2:16"
            ],
            "category": 1
        },
        {
            "question": "When did Paola catch the flu?",
            "answer": "13 January, 2024",
            "evidence": [
                "D7:2"
            ],
            "category": 2
        },
        {
            "question": "What books have Paola read?",
            "answer": "\"The Night Circus\" by Erin Morgenstern, \"The Alchemist\" by Paulo Coelho, \"Where the Crawdads Sing\" by Delia Owens, \"A Gentleman in Moscow\" by Amor Towles.",
            "evidence": [
                "D2:13",
                "D4:5",
                "D7:6",
                "D12:25"
            ],
            "category": 1
        },
        {
            "question": "What movies did Emi watch?",
            "answer": "\"The Shawshank Redemption\", \"Hunger Games\" series, \"Lord of the Rings\" trilogy, the \"Star Wars\" saga, the \"Marvel Cinematic Universe\" movies, \"The Notebook\", \"Up\", \"Crazy, Stupid, Love\".",
            "evidence": [
                "D7:7",
                "D3:3",
                "D3:6",
                "D3:11",
                "D14:4"
            ],
            "category": 1
        },
        {
            "question": "Which decade does the term ‘Roaring Twenties’ refer to that Paola wants to time travel?",
            "answer": "1920s decade.",
            "evidence": [
                "D7:17"
            ],
            "category": 3
        },
        {
            "question": "In what century was the Renaissance period, that Emi wants to time travel?",
            "answer": "From the 14th century to the 17th century.",
            "evidence": [
                "D7:19"
            ],
            "category": 3
        },
        {
            "question": "When did Paola's friend visit Santorini?",
            "answer": "Summer 2023.",
            "evidence": [
                "D7:24"
            ],
            "category": 2
        },
        {
            "question": "What kind of housework did Paola do?",
            "answer": "Redecorating her living room, gardening, reorganizing the bookshelf.",
            "evidence": [
                "D8:15",
                "D12:3",
                "D4:22"
            ],
            "category": 1
        },
        {
            "question": "When did Emi travel from Idaho back to Los Angeles?",
            "answer": "15 January, 2024",
            "evidence": [
                "D8:23"
            ],
            "category": 2
        },
        {
            "question": "When does Paola plan a road trip through the southwestern USA?",
            "answer": "In a couple of months since 15.01.2024.",
            "evidence": [
                "D8:24"
            ],
            "category": 2
        },
        {
            "question": "What tips did Paola give to Emi?",
            "answer": "How to pack for the Pacific Northwest, how to cope with a breakup.",
            "evidence": [
                "D8:30",
                "D13:24"
            ],
            "category": 1
        },
        {
            "question": "What did Paola have in math class on 17.01.2024?",
            "answer": "A surprise quiz.",
            "evidence": [
                "D9:4"
            ],
            "category": 2
        },
        {
            "question": "What are Emi's hobbies?",
            "answer": "Playing the guitar, reading, pilates.",
            "evidence": [
                "D9:7",
                "D3:38",
                "D10:20"
            ],
            "category": 1
        },
        {
            "question": "Is Paola an artistic person?",
            "answer": "Yes, she plays the piano, goes to the art gallery, is interested in architecture, and does photography.",
            "evidence": [
                "D10:2",
                "D2:3",
                "D1:24",
                "D6:27"
            ],
            "category": 3
        },
        {
            "question": "When did Paola cook rice and vegetables?",
            "answer": "16 January, 2024",
            "evidence": [
                "D9:12"
            ],
            "category": 2
        },
        {
            "question": "Which class did Emi attend for the first time on 19.01.2024?",
            "answer": "Pilates.",
            "evidence": [
                "D10:20"
            ],
            "category": 2
        },
        {
            "question": "What sitcom did Emi start rewatching on 21.01.2024?",
            "answer": "\"Friends\".",
            "evidence": [
                "D11:2"
            ],
            "category": 2
        },
        {
            "question": "Which recipe did Paola try on 21.01.2024?",
            "answer": "Homemade pizza.",
            "evidence": [
                "D11:3"
            ],
            "category": 2
        },
        {
            "question": "When did Paola garden?",
            "answer": "21.01.2024",
            "evidence": [
                "D12:3"
            ],
            "category": 2
        },
        {
            "question": "When does Emi plan to work on her little herb garden?",
            "answer": "22.01.2024",
            "evidence": [
                "D12:5"
            ],
            "category": 2
        },
        {
            "question": "When did Paola start dating her boyfriend?",
            "answer": "Three years ago before 01.2024",
            "evidence": [
                "D12:21"
            ],
            "category": 2
        },
        {
            "question": "Which countries did Paola want to go to for a trip with her boyfriend?",
            "answer": "France or Italy, as Paris is the capital of France and Verona is a city in Italy.",
            "evidence": [
                "D12:23"
            ],
            "category": 3
        },
        {
            "question": "What book is Emi reading on 21.01.2024?",
            "answer": "\"Where the Crawdads Sing\" by Delia Owens.",
            "evidence": [
                "D12:24"
            ],
            "category": 2
        },
        {
            "question": "When did Paola visit Crete?",
            "answer": "A few years ago before 2024.",
            "evidence": [
                "D12:29"
            ],
            "category": 2
        },
        {
            "question": "Who are Emi and Paola's acquaintances in Australia?",
            "answer": "Emi's boyfriend, Paola's male friend.",
            "evidence": [
                "D13:22",
                "D1:20"
            ],
            "category": 1
        },
        {
            "question": "When did Emi's boyfriend break up with her?",
            "answer": "23 January, 2024",
            "evidence": [
                "D13:22"
            ],
            "category": 2
        },
        {
            "question": "Does Emi have a healthy lifestyle?",
            "answer": "Yes, Emi maintains a healthy diet, engages in regular exercise, goes hiking, and goes to pilates classes.",
            "evidence": [
                "D13:31",
                "D1:29",
                "D10:20"
            ],
            "category": 3
        },
        {
            "question": "What are Paola's main activities?",
            "answer": "Going to school, going to work, working on a personal project.",
            "evidence": [
                "D9:4",
                "D14:3"
            ],
            "category": 1
        },
        {
            "question": "What movies or tv shows did Emi recommend to Paola?",
            "answer": "\"Gossip Girl\", \"The Shawshank Redemption\", \"Up\", \"Crazy, Stupid, Love\", \"Brooklyn Nine-Nine\".",
            "evidence": [
                "D1:3",
                "D14:4"
            ],
            "category": 1
        },
        {
            "question": "What movie did Paola watch on 25.01.2024?",
            "answer": "\"Up\".",
            "evidence": [
                "D14:7"
            ],
            "category": 2
        },
        {
            "question": "When did Emi cook vegetable stir-fry?",
            "answer": "25 January, 2024",
            "evidence": [
                "D14:11"
            ],
            "category": 2
        },
        {
            "question": "What movies did Paola watch?",
            "answer": "\"Up\", \"The Notebook\", \"Superbad\", \"Bridesmaids\", \"Step Brothers\", \"The Shawshank Redemption\", \"A Beautiful Mind\", \"Gone Girl\".",
            "evidence": [
                "D14:23",
                "D3:9",
                "D3:13",
                "D7:6",
                "D7:10"
            ],
            "category": 1
        },
        {
            "question": "Which meeting did Paola have in the evening on 25.01.2024?",
            "answer": "A virtual book club.",
            "evidence": [
                "D14:29"
            ],
            "category": 2
        }
    ]
}